Repository: powfuu/weight-tracker
Catalog: Weight Progress Tracker/*.lproj/Localizable.strings
Languages: de_de, es_es, fr_fr, ja, ko, zh_hans, zh_hant

# welcome
source: Welcome to Weight Tracker
de_de: Willkommen bei Weight Tracker
es_es: Bienvenido a Weight Tracker
fr_fr: Bienvenue dans Weight Tracker
ja: Weight Trackerへようこそ
ko: Weight Tracker에 오신 것을 환영합니다
zh_hans: 欢迎使用 Weight Tracker
zh_hant: 歡迎使用 Weight Tracker

# get_started
source: Start Tracking
de_de: Tracking starten
es_es: Comenzar Seguimiento
fr_fr: Commencer le Suivi
ja: トラッキングを開始
ko: 추적 시작
zh_hans: 开始体重跟踪器
zh_hant: 開始追蹤

# weight_progress_title
source: Weight Progress
de_de: Gewichtsfortschritt
es_es: Progreso de Peso
fr_fr: Progrès de Poids
ja: 体重進捗
ko: 체중 진행
zh_hans: 体重进度
zh_hant: 體重進度

# welcome_subtitle
source: Your weight tracking companion
de_de: Ihr Begleiter für die Gewichtsverfolgung
es_es: Tu compañero de seguimiento de peso
fr_fr: Votre compagnon de suivi de poids
ja: あなたの体重追跡パートナー
ko: 당신의 체중 추적 동반자
zh_hans: 您的体重跟踪伴侣
zh_hant: 您的體重追蹤夥伴

# welcome_message
source: Welcome to Weight Progress!
de_de: Willkommen bei Weight Progress!
es_es: ¡Bienvenido a Weight Progress!
fr_fr: Bienvenue dans Weight Progress !
ja: Weight Progressへようこそ！
ko: Weight Progress에 오신 것을 환영합니다!
zh_hans: 欢迎使用体重进度！
zh_hant: 歡迎使用體重進度！

# setup_profile_message
source: Set up your profile to start tracking your progress intelligently and personally
de_de: Richten Sie Ihr Profil ein, um Ihren Fortschritt intelligent und persönlich zu verfolgen
es_es: Configura tu perfil para comenzar
fr_fr: Configurez votre profil pour commencer
ja: 開始するためにプロフィールを設定してください
ko: 프로필을 설정하여 진행상황을 스마트하고 개인적으로 추적하세요
zh_hans: 设置您的个人资料以开始
zh_hant: 設定您的個人資料以開始

# get_started_button
source: Get Started
de_de: Loslegen
es_es: Comenzar
fr_fr: Commencer
ja: 開始
ko: 시작하기
zh_hans: 开始
zh_hant: 開始

# no_records_time
source: No records
de_de: Keine Aufzeichnungen
es_es: Sin registros
fr_fr: Aucun enregistrement
ja: 記録なし
ko: 기록 없음
zh_hans: 无记录
zh_hant: 無記錄

source: %@ days ago
de_de: Vor %@ Tagen
es_es: Hace %@ días
fr_fr: Il y a %@ jours
ja: %@日前
ko: %@일 전
zh_hans: %@天前
zh_hant: %@天前

source: %@ day ago
de_de: Vor %@ Tag
es_es: Hace %@ día
fr_fr: Il y a %@ jour
ja: %@日前
ko: %@일 전
zh_hans: %@天前
zh_hant: %@天前

# hours_ago
source: %@ h ago
de_de: Vor %@ h
es_es: Hace %@ h
fr_fr: Il y a %@ h
ja: %@時間前
ko: %@시간 전
zh_hans: %@小时前
zh_hant: %@小時前

# less_than_hour
source: Less than 1 h ago
de_de: Vor weniger als 1 h
es_es: Hace menos de 1 h
fr_fr: Il y a moins d'1 h
ja: 1時間未満前
ko: 1시간 미만 전
zh_hans: 不到1小时前
zh_hant: 不到1小時前

source: Insufficient data
de_de: Unzureichende Daten
es_es: Datos insuficientes
fr_fr: Données insuffisantes
ja: データ不足
ko: 데이터 부족
zh_hans: 数据不足
zh_hant: 資料不足

# insufficient_data_insights
source: Not enough data to generate insights
de_de: Nicht genügend Daten für Erkenntnisse
es_es: Sin datos suficientes
fr_fr: Pas assez de données pour générer des insights
ja: インサイトを生成するのに十分なデータがありません
ko: 인사이트를 생성하기에 충분한 데이터가 없습니다
zh_hans: 数据不足，无法生成洞察
zh_hant: 資料不足，無法產生洞察

# fifteen_days
source: 15 days
de_de: 15 Tage
es_es: 15 días
fr_fr: 15 jours
ja: 15日
ko: 15일
zh_hant: 15天

# three_months
source: 3 months
de_de: 3 Monate
es_es: 3 meses
fr_fr: 3 mois
ja: 3ヶ月
ko: 3개월
zh_hant: 3個月

# in_fifteen_days
source: in 15 days
es_es: en 15 días
fr_fr: en 15 jours
ja: 15日間で
ko: 15일 동안
zh_hant: 在15天內

# in_three_months
source: in 3 months
es_es: en 3 meses
fr_fr: en 3 mois
ja: 3ヶ月間で
ko: 3개월 동안
zh_hant: 在3個月內

# weight_stable_week
source: Your weight has remained stable this week. Excellent consistency!
de_de: Ihr Gewicht ist diese Woche stabil geblieben. Ausgezeichnete Beständigkeit!
es_es: Tu peso se ha mantenido estable esta semana. ¡Excelente consistencia!
fr_fr: Votre poids est resté stable cette semaine. Excellente constance !
ja: 今週は体重が安定しています。素晴らしい一貫性です！
ko: 이번 주 체중이 안정적으로 유지되었습니다. 훌륭한 일관성입니다!
zh_hans: 您的体重本周保持稳定。保持一致性很棒！
zh_hant: 您的體重本週保持穩定。保持一致性很棒！

source: Excellent progress!
de_de: Ausgezeichneter Fortschritt!
es_es: ¡Excelente progreso!
fr_fr: Excellent progrès !
ja: 素晴らしい進歩！
ko: 훌륭한 진전!
zh_hans: 进展优秀！
zh_hant: 進展優秀！

# lost_weight_week
source: You've lost %@ %@ this week. Keep it up!
de_de: Sie haben diese Woche %@ %@ verloren. Weiter so!
es_es: Has perdido %@ %@ esta semana. ¡Sigue así!
fr_fr: Vous avez perdu %@ %@ cette semaine. Continuez !
ja: 今週%@ %@減量しました。続けてください！
ko: 이번 주 %@ %@ 감량했습니다. 계속하세요!
zh_hans: 您本周减重%@ %@。继续保持！
zh_hant: 您本週減重%@ %@。繼續保持！

# keep_focus_goal
source: Stay focused on your goal.
de_de: Bleiben Sie auf Ihr Ziel fokussiert.
es_es: Mantén el enfoque en tu objetivo.
fr_fr: Restez concentré sur votre objectif.
ja: 目標に集中し続けてください。
ko: 목표에 집중하세요.
zh_hans: 专注于您的目标。
zh_hant: 專注於您的目標。

# gained_weight_week
source: You've gained %@ %@ this week.
de_de: Sie haben diese Woche %@ %@ zugenommen.
es_es: Has ganado %@ %@ esta semana.
fr_fr: Vous avez pris %@ %@ cette semaine.
ja: 今週%@ %@増量しました。
ko: 이번 주 %@ %@ 증가했습니다.
zh_hans: 您本周增重%@ %@。
zh_hant: 您本週增重%@ %@。

# average_weight_month
source: Your average weight this month is %@ %@. Keep up the consistency.
de_de: Ihr Durchschnittsgewicht diesen Monat ist %@ %@. Behalten Sie die Beständigkeit bei.
es_es: Tu peso promedio este mes es %@ %@. Mantén la consistencia.
fr_fr: Votre poids moyen ce mois est %@ %@. Maintenez la constance.
ja: 今月の平均体重は%@ %@です。一貫性を保ってください。
ko: 이번 달 평균 체중은 %@ %@입니다. 일관성을 유지하세요.
zh_hans: 您本月的平均体重是%@ %@。保持一致性。
zh_hant: 您本月的平均體重是%@ %@。保持一致性。

# lost_weight_month
source: You've lost %@ %@ this month (%@ %@/week).
de_de: Sie haben diesen Monat %@ %@ verloren (%@ %@/Woche).
es_es: Has perdido %@ %@ este mes (%@ %@/semana).
fr_fr: Vous avez perdu %@ %@ ce mois (%@ %@/semaine).
ja: 今月%@ %@減量しました（週%@ %@）。
ko: 이번 달 %@ %@ 감량했습니다(주당 %@ %@).
zh_hans: 您本月减重%@ %@（每周%@ %@）。
zh_hant: 您本月減重%@ %@（每週%@ %@）。

# gained_weight_month
source: You've gained %@ %@ this month (%@ %@/week).
de_de: Sie haben diesen Monat %@ %@ zugenommen (%@ %@/Woche).
es_es: Has ganado %@ %@ este mes (%@ %@/semana).
fr_fr: Vous avez pris %@ %@ ce mois (%@ %@/semaine).
ja: 今月%@ %@増量しました（週%@ %@）。
ko: 이번 달 %@ %@ 증가했습니다(주당 %@ %@).
zh_hans: 您本月增重%@ %@（每周%@ %@）。
zh_hant: 您本月增重%@ %@（每週%@ %@）。

# lost_weight_quarter
source: In the last 3 months you've lost %@ %@ (%@ %@/month).
de_de: In den letzten 3 Monaten haben Sie %@ %@ verloren (%@ %@/Monat).
es_es: En los últimos 3 meses has perdido %@ %@ (%@ %@/mes).
fr_fr: Ces 3 derniers mois vous avez perdu %@ %@ (%@ %@/mois).
ja: 過去3ヶ月で%@ %@減量しました（月%@ %@）。
ko: 지난 3개월 동안 %@ %@ 감량했습니다(월당 %@ %@).
zh_hans: 在过去3个月中，您减重%@ %@（每月%@ %@）。
zh_hant: 在過去3個月中，您減重%@ %@（每月%@ %@）。

# gained_weight_quarter
source: In the last 3 months you've gained %@ %@ (%@ %@/month).
de_de: In den letzten 3 Monaten haben Sie %@ %@ zugenommen (%@ %@/Monat).
es_es: En los últimos 3 meses has ganado %@ %@ (%@ %@/mes).
fr_fr: Ces 3 derniers mois vous avez pris %@ %@ (%@ %@/mois).
ja: 過去3ヶ月で%@ %@増量しました（月%@ %@）。
ko: 지난 3개월 동안 %@ %@ 증가했습니다(월당 %@ %@).
zh_hans: 在过去3个月中，您增重%@ %@（每月%@ %@）。
zh_hant: 在過去3個月中，您增重%@ %@（每月%@ %@）。

# lost_weight_year
source: In the last year you've lost %@ %@ (%@ %@/month).
de_de: Im letzten Jahr haben Sie %@ %@ verloren (%@ %@/Monat).
es_es: En el último año has perdido %@ %@ (%@ %@/mes).
fr_fr: Cette dernière année vous avez perdu %@ %@ (%@ %@/mois).
ja: 過去1年で%@ %@減量しました（月%@ %@）。
ko: 지난 1년 동안 %@ %@ 감량했습니다(월당 %@ %@).
zh_hans: 在过去一年中，您减重%@ %@（每月%@ %@）。
zh_hant: 在過去一年中，您減重%@ %@（每月%@ %@）。

# gained_weight_year
source: In the last year you've gained %@ %@ (%@ %@/month).
de_de: Im letzten Jahr haben Sie %@ %@ zugenommen (%@ %@/Monat).
es_es: En el último año has ganado %@ %@ (%@ %@/mes).
fr_fr: Cette dernière année vous avez pris %@ %@ (%@ %@/mois).
ja: 過去1年で%@ %@増量しました（月%@ %@）。
ko: 지난 1년 동안 %@ %@ 증가했습니다(월당 %@ %@).
zh_hans: 在过去一年中，您增重%@ %@（每月%@ %@）。
zh_hant: 在過去一年中，您增重%@ %@（每月%@ %@）。

source: Import Health
de_de: Gesundheit importieren
es_es: Importar Salud
fr_fr: Importer Santé
ja: ヘルスケアをインポート
ko: 건강 가져오기
zh_hans: 导入健康
zh_hant: 匯入健康

# import_health_subtitle
source: Sync with Apple Health
de_de: Mit Apple Health synchronisieren
es_es: Sincronizar con Apple Health
fr_fr: Synchroniser avec Apple Santé
ja: Apple Healthと同期
ko: Apple Health와 동기화
zh_hans: 与Apple健康同步
zh_hant: 與Apple健康同步

source: Export CSV
de_de: CSV exportieren
es_es: Exportar CSV
fr_fr: Exporter CSV
ja: CSVエクスポート
ko: CSV 내보내기
zh_hans: 导出CSV
zh_hant: 匯出CSV

# export_csv_subtitle
source: Download data
de_de: Daten herunterladen
es_es: Descargar datos
fr_fr: Télécharger les données
ja: データをダウンロード
ko: 데이터 다운로드
zh_hans: 下载数据
zh_hant: 下載資料

# edit_goal_action
source: Edit Goal
de_de: Ziel bearbeiten
es_es: Editar Meta
fr_fr: Modifier Objectif
ja: 目標を編集
ko: 목표 편집
zh_hans: 编辑目标
zh_hant: 編輯目標

# edit_goal_subtitle
source: Modify objective
de_de: Ziel ändern
es_es: Modificar objetivo
fr_fr: Modifier l'objectif
ja: 目標を変更
ko: 목표 수정
zh_hans: 修改目标
zh_hant: 修改目標

# create_goal_action
source: Create Goal
de_de: Ziel erstellen
es_es: Crear Meta
fr_fr: Créer Objectif
ja: 目標を作成
ko: 목표 생성
zh_hans: 创建目标
zh_hant: 建立目標

# create_goal_subtitle
source: Set objective
de_de: Ziel festlegen
es_es: Establecer objetivo
fr_fr: Définir un objectif
ja: 目標を設定
ko: 목표 설정
zh_hans: 设定目标
zh_hant: 設定目標

source: Theme
de_de: Design
es_es: Tema
fr_fr: Thème
ja: テーマ
ko: 테마
zh_hans: 主题
zh_hant: 主題

source: Dark
de_de: Dunkel
es_es: Oscuro
fr_fr: Sombre
ja: ダーク
ko: 다크
zh_hans: 深色
zh_hant: 深色

source: Language
de_de: Sprache
es_es: Idioma
fr_fr: Langue
ja: 言語
ko: 언어
zh_hans: 语言
zh_hant: 語言

source: Select Language
de_de: Sprache auswählen
es_es: Seleccionar Idioma
fr_fr: Sélectionner la langue
ja: 言語を選択
ko: 언어 선택
zh_hans: 选择语言
zh_hant: 選擇語言

# select_language_desc
source: Choose your preferred language for the best experience
de_de: Wählen Sie Ihre bevorzugte Sprache für die beste Erfahrung
es_es: Elige tu idioma preferido para la mejor experiencia
fr_fr: Choisissez votre langue préférée pour la meilleure expérience
ja: 最高の体験のために、お好みの言語を選択してください
ko: 최고의 경험을 위해 선호하는 언어를 선택하세요
zh_hans: 为了获得最佳体验，请选择您的首选语言
zh_hant: 為了獲得最佳體驗，請選擇您的首選語言

# choose_language
source: Choose your preferred language
de_de: Wählen Sie Ihre bevorzugte Sprache
es_es: Elige tu idioma preferido
fr_fr: Choisissez votre langue préférée
ja: お好みの言語を選択してください
ko: 선호하는 언어를 선택하세요
zh_hans: 选择您的首选语言
zh_hant: 選擇您的首選語言

source: Next
de_de: Weiter
es_es: Siguiente
fr_fr: Suivant
ja: 次へ
ko: 다음
zh_hans: 下一步
zh_hant: 下一步

source: Back
de_de: Zurück
es_es: Volver
fr_fr: Retour
ja: 戻る
ko: 뒤로
zh_hans: 返回
zh_hant: 返回

source: Period
de_de: Zeitraum
es_es: Período
fr_fr: Période
ja: 期間
ko: 기간
zh_hans: 时期
zh_hant: 時期

source: Finish
de_de: Fertig
es_es: Finalizar
fr_fr: Terminer
ja: 完了
ko: 완료
zh_hans: 完成
zh_hant: 完成

source: Skip
de_de: Überspringen
es_es: Omitir
fr_fr: Ignorer
ja: スキップ
ko: 건너뛰기
zh_hans: 跳过
zh_hant: 跳過

source: Home
de_de: Startseite
es_es: Inicio
fr_fr: Accueil
ja: ホーム
ko: 홈
zh_hans: 主页
zh_hant: 首頁

source: Progress
de_de: Fortschritt
es_es: Progreso
fr_fr: Progrès
ja: 進捗
ko: 진행상황
zh_hans: 进度
zh_hant: 進度

source: Initial Steps
de_de: Erste Schritte
es_es: Pasos Iniciales
fr_fr: Étapes initiales
ja: 初期設定
ko: 초기 설정
zh_hans: 初始步骤
zh_hant: 初始步驟

# step_language
source: Language
de_de: Sprache
es_es: Idioma
fr_fr: Langue
ja: 言語
ko: 언어
zh_hans: 语言
zh_hant: 語言

# step_weight
source: Weight
de_de: Gewicht
es_es: Peso
fr_fr: Poids
ja: 体重
ko: 체중
zh_hans: 体重
zh_hant: 體重

# step_units
source: Units
de_de: Einheiten
es_es: Unidades
fr_fr: Unités
ja: 単位
ko: 단위
zh_hans: 单位
zh_hant: 單位

# step_notifications
source: Notifications
de_de: Benachrichtigungen
es_es: Notificaciones
ja: 通知
ko: 알림
zh_hans: 通知
zh_hant: 通知

# step_goal
source: Goal
de_de: Ziel
es_es: Objetivo
fr_fr: Objectif
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

source: Language Selection
de_de: Sprachauswahl
es_es: Selección de Idioma
fr_fr: Sélection de la langue
ja: 言語選択
ko: 언어 선택
zh_hans: 语言选择
zh_hant: 語言選擇

# language_selection_desc
source: Choose your preferred language for the best experience
de_de: Wählen Sie Ihre bevorzugte Sprache für die beste Erfahrung
es_es: Elige tu idioma preferido para la mejor experiencia
fr_fr: Choisissez votre langue préférée pour la meilleure expérience
ja: 最高の体験のためにお好みの言語を選択してください
ko: 최상의 경험을 위해 선호하는 언어를 선택하세요
zh_hans: 选择您的首选语言以获得最佳体验
zh_hant: 選擇您的首選語言以獲得最佳體驗

# first_weight
source: First Weight Entry
de_de: Erste Gewichtseingabe
es_es: Primera Entrada de Peso
fr_fr: Première Entrée de Poids
ja: 最初の体重入力
ko: 첫 번째 체중 입력
zh_hans: 第一次体重输入
zh_hant: 第一次體重輸入

# first_weight_desc
source: Enter your current weight to start your journey
de_de: Geben Sie Ihr aktuelles Gewicht ein, um Ihre Reise zu beginnen
es_es: Ingresa tu peso actual para comenzar tu seguimiento
fr_fr: Entrez votre poids actuel pour commencer votre parcours
ja: あなたの旅を始めるために、現在の体重を入力してください
ko: 여정을 시작하기 위해 현재 체중을 입력하세요
zh_hans: 输入您当前的体重以开始您的追踪之旅
zh_hant: 輸入您當前的體重以開始您的追蹤之旅

# enter_weight
source: Log Your Weight
de_de: Ihr Gewicht eingeben
es_es: Registra tu Peso
fr_fr: Enregistrer Votre Poids
ja: 体重を記録
ko: 체중 기록
zh_hans: 记录体重
zh_hant: 記錄體重

source: Weight Units
de_de: Gewichtseinheiten
es_es: Unidades de Peso
fr_fr: Unités de Poids
ja: 体重単位
ko: 체중 단위
zh_hans: 体重单位
zh_hant: 體重單位

# weight_units_desc
source: Choose your preferred unit of measurement
de_de: Wählen Sie Ihre bevorzugte Maßeinheit
es_es: Elige tu unidad de medida preferida
fr_fr: Choisissez votre unité de mesure préférée
ja: お好みの測定単位を選択してください
ko: 선호하는 측정 단위를 선택하세요
zh_hans: 选择您的首选测量单位
zh_hant: 選擇您的首選測量單位

source: kilograms
de_de: Kilogramm (kg)
es_es: Kilogramos (kg)
fr_fr: Kilogrammes (kg)
ja: キログラム
ko: 킬로그램
zh_hans: 公斤
zh_hant: 公斤

source: pounds
de_de: Pfund (lb)
es_es: Libras (lb)
fr_fr: Livres (lb)
ja: ポンド
ko: 파운드
zh_hans: 磅
zh_hant: 磅

source: Notifications
de_de: Benachrichtigungen
es_es: Notificaciones
ja: 通知
ko: 알림
zh_hans: 通知
zh_hant: 通知

# notifications_desc
source: We may send local notifications to remind you to log your weight. These notifications are generated locally on your device and do not involve external servers.
de_de: Lassen Sie sich daran erinnern, Ihren Fortschritt zu verfolgen
es_es: Recibe recordatorios para seguir tu progreso
fr_fr: Recevez des rappels pour suivre votre progression
ja: 進捗を追跡するためのリマインダーを受け取る
ko: 진행 상황을 추적하기 위한 알림 받기
zh_hans: 我们可能会发送本地通知来提醒您记录体重。这些通知在您的设备上本地生成，不涉及外部服务器。
zh_hant: 接收通知以追蹤您的進度

source: Enable Notifications
de_de: Benachrichtigungen aktivieren
es_es: Habilitar Notificaciones
fr_fr: Activer les Notifications
ja: 通知を有効にする
ko: 알림 활성화
zh_hans: 启用通知
zh_hant: 啟用通知

source: Notification Time
de_de: Benachrichtigungszeit
es_es: Hora de Notificación
fr_fr: Heure de notification
ja: 通知時間
ko: 알림 시간
zh_hans: 通知时间
zh_hant: 通知時間

source: Goal Setup
de_de: Ziel Einrichtung
es_es: Configuración de Objetivo
fr_fr: Configuration d'Objectif
ja: 目標設定
ko: 목표 설정
zh_hans: 目标设置
zh_hant: 目標設置

# goal_setup_desc
source: Set a goal to stay motivated in your fitness journey
de_de: Setzen Sie ein Ziel, um in Ihrer Fitness-Reise motiviert zu bleiben
es_es: Establece un objetivo para mantenerte motivado en tu viaje
fr_fr: Définissez un objectif pour rester motivé dans votre parcours fitness
ja: フィットネスの旅でモチベーションを保つために目標を設定
ko: 피트니스 여정에서 동기를 유지하기 위해 목표를 설정하세요
zh_hans: 设置目标以在您的健身之旅中保持动力
zh_hant: 設置目標以在您的健身之旅中保持動力

source: Skip for now
de_de: Vorerst überspringen
es_es: Omitir por ahora
fr_fr: Ignorer pour l'instant
ja: 今はスキップ
ko: 지금은 건너뛰기
zh_hans: 暂时跳过
zh_hant: 暫時跳過

source: Create Goal
de_de: Ziel erstellen
es_es: Crear Objetivo
fr_fr: Créer un Objectif
ja: 目標を作成
ko: 목표 생성
zh_hans: 创建目标
zh_hant: 創建目標

# goal_type_lose
source: Lose
de_de: Abnehmen
es_es: Pérdida de Peso
fr_fr: Perdre
ja: 減量
ko: 감량
zh_hans: 减重
zh_hant: 減重

# goal_type_gain
source: Gain
de_de: Zunehmen
es_es: Aumento de Peso
fr_fr: Prendre
ja: 増量
ko: 증량
zh_hans: 增重
zh_hant: 增重

# goal_type_maintain
source: Maintain
de_de: Halten
es_es: Mantener Peso
fr_fr: Maintenir
ja: 維持
ko: 유지
zh_hans: 维持
zh_hant: 維持

source: Target date
de_de: Zieldatum
es_es: Fecha Objetivo
fr_fr: Date cible
ja: 目標日
ko: 목표 날짜
zh_hans: 目标日期
zh_hant: 目標日期

source: Weight Progress
de_de: Gewichts-Fortschritt
es_es: Progreso de Peso
fr_fr: Progrès de Poids
ja: 体重進捗
ko: 체중 진행 상황
zh_hans: 体重跟踪器进度
zh_hant: 體重進度

source: Current weight
de_de: Aktuelles Gewicht
es_es: Peso Actual
fr_fr: Poids Actuel
ja: 現在の体重
ko: 현재 체중
zh_hans: 当前体重
zh_hant: 當前體重

# goal_weight
source: Target Weight
de_de: Zielgewicht
es_es: Objetivo de Peso
fr_fr: Poids Cible
ja: 目標体重
ko: 목표 체중
zh_hans: 目标体重
zh_hant: 目標體重

# add_weight
source: Log Weight
de_de: Gewicht protokollieren
es_es: Registrar Peso
fr_fr: Enregistrer le Poids
ja: 体重を記録
ko: 체중 기록
zh_hans: 添加体重
zh_hant: 記錄體重

source: Edit Weight
de_de: Gewicht bearbeiten
es_es: Editar Peso
fr_fr: Modifier le Poids
ja: 体重を編集
ko: 체중 편집
zh_hans: 编辑体重
zh_hant: 編輯體重

source: Delete Weight
de_de: Gewicht löschen
es_es: Eliminar Peso
fr_fr: Supprimer le Poids
ja: 体重を削除
ko: 체중 삭제
zh_hans: 删除体重
zh_hant: 刪除體重

# insights
source: Statistics
de_de: Statistiken
es_es: Estadísticas
fr_fr: Statistiques
ja: 統計
ko: 통계
zh_hans: 统计
zh_hant: 統計

source: Weekly Progress
de_de: Wöchentlicher Fortschritt
es_es: Progreso Semanal
fr_fr: Progrès Hebdomadaire
ja: 週間進捗
ko: 주간 진행 상황
zh_hans: 每周进度
zh_hant: 每週進度

source: Monthly Progress
de_de: Monatlicher Fortschritt
es_es: Progreso Mensual
fr_fr: Progrès Mensuel
ja: 月間進捗
ko: 월간 진행 상황
zh_hans: 每月进度
zh_hant: 每月進度

# streak
source: Tracking Streak
de_de: Verfolgungs-Serie
es_es: Racha de Seguimiento
fr_fr: Série de Suivi
ja: 追跡ストリーク
ko: 추적 연속 기록
zh_hans: 追踪连续记录
zh_hant: 追蹤連續記錄

source: days
de_de: Tage
es_es: días
fr_fr: jours
ja: 日
ko: 일
zh_hans: 天
zh_hant: 天

source: weeks
de_de: Wochen
es_es: semanas
fr_fr: semaines
ja: 週間
ko: 주
zh_hans: 周
zh_hant: 週

source: months
de_de: Monate
es_es: meses
fr_fr: mois
ja: ヶ月
ko: 개월
zh_hans: 月
zh_hant: 月

source: year
de_de: Jahr
es_es: año
fr_fr: année
ja: 年
ko: 년
zh_hans: 年
zh_hant: 年

# avg
source: Average
de_de: Durchschnitt
es_es: Promedio
fr_fr: Moyenne
ja: 平均
ko: 평균
zh_hans: 平均
zh_hant: 平均

# min
source: Minimum
es_es: Mínimo
ja: 最小
ko: 최소
zh_hans: 最小
zh_hant: 最小

# max
source: Maximum
es_es: Máximo
ja: 最大
ko: 최대
zh_hans: 最大
zh_hant: 最大

# select_unit
source: Select Weight Unit
de_de: Gewichtseinheit auswählen
es_es: Seleccionar Unidad de Peso
fr_fr: Sélectionner l'unité de poids
ja: 重量単位を選択
ko: 체중 단위 선택
zh_hans: 选择体重单位
zh_hant: 選擇重量單位

# select_unit_desc
source: Choose the unit you want to use for weight tracking
de_de: Wählen Sie die Einheit, die Sie für den Gewichtstracker verwenden möchten
es_es: Elige la unidad que quieres usar para el seguimiento de peso
fr_fr: Choisissez l'unité que vous souhaitez utiliser pour le tracker de poids
ja: 体重トラッカーに使用したい単位を選択してください
ko: 체중 추적에 사용할 단위를 선택하세요
zh_hans: 选择您想要用于体重跟踪的单位
zh_hant: 選擇您想要用於體重追蹤的單位

# kg
source: Kilograms
de_de: kg
es_es: kg
fr_fr: kg
ja: キロ
ko: 킬로그램
zh_hans: 千克
zh_hant: 公斤

# lb
source: Pounds
de_de: Pfund
es_es: lb
fr_fr: Livres
ja: ポンド
ko: 파운드
zh_hans: 磅
zh_hant: 磅

# kg_desc
source: Metric system (kg)
de_de: Metrisches System (kg)
es_es: Sistema métrico (kg)
fr_fr: Système métrique (kg)
ja: メートル法
ko: 미터법
zh_hans: 公制系统 (kg)
zh_hant: 公制系統

# lb_desc
source: Imperial system (lb)
de_de: Imperiales System (lb)
es_es: Sistema imperial (lb)
fr_fr: Système impérial (lb)
ja: ヤード・ポンド法
ko: 야드파운드법
zh_hans: 英制系统 (lb)
zh_hant: 英制系統

source: Weight
de_de: Gewicht
es_es: Peso
fr_fr: Poids
ja: 体重
ko: 체중
zh_hans: 体重
zh_hant: 體重

source: Date
de_de: Datum
es_es: Fecha
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

source: Save
de_de: Speichern
es_es: Guardar
fr_fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 保存

source: Cancel
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

source: Delete
de_de: Löschen
es_es: Eliminar
fr_fr: Supprimer
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

source: Edit
de_de: Bearbeiten
es_es: Editar
fr_fr: Modifier
ja: 編集
ko: 편집
zh_hans: 编辑
zh_hant: 編輯

# weight_saved
source: Weight saved successfully
de_de: Gewicht erfolgreich gespeichert
es_es: Peso guardado exitosamente
fr_fr: Poids enregistré avec succès
ja: 体重が正常に保存されました
ko: 체중이 성공적으로 저장되었습니다
zh_hans: 体重保存成功
zh_hant: 體重保存成功

# weight_deleted
source: Weight deleted successfully
de_de: Gewicht erfolgreich gelöscht
es_es: Peso eliminado exitosamente
fr_fr: Poids supprimé avec succès
ja: 体重が正常に削除されました
ko: 체중이 성공적으로 삭제되었습니다
zh_hans: 体重删除成功
zh_hant: 體重刪除成功

source: Success
de_de: Erfolg
es_es: Éxito
fr_fr: Succès
ja: 成功
ko: 성공
zh_hans: 成功
zh_hant: 成功

source: Today
de_de: Heute
es_es: Hoy
fr_fr: Aujourd'hui
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

source: Yesterday
de_de: Gestern
es_es: Ayer
fr_fr: Hier
ja: 昨日
ko: 어제
zh_hans: 昨天
zh_hant: 昨天

source: this week
de_de: Diese Woche
es_es: Esta Semana
fr_fr: Cette semaine
ja: 今週
ko: 이번 주
zh_hans: 本周
zh_hant: 本週

source: Last Week
de_de: Letzte Woche
es_es: Semana Pasada
fr_fr: Semaine dernière
ja: 先週
ko: 지난 주
zh_hans: 上周
zh_hant: 上週

source: this month
de_de: Dieser Monat
es_es: Este Mes
fr_fr: Ce mois
ja: 今月
ko: 이번 달
zh_hans: 本月
zh_hant: 本月

source: Last Month
de_de: Letzter Monat
es_es: Mes Pasado
fr_fr: Mois dernier
ja: 先月
ko: 지난 달
zh_hans: 上月
zh_hant: 上月

source: Quick Select
de_de: Schnellauswahl
es_es: Selección Rápida
fr_fr: Sélection Rapide
ja: クイック選択
ko: 빠른 선택
zh_hans: 快速选择
zh_hant: 快速選擇

# first_weight_info
source: This will be your initial reference weight
de_de: Dies wird Ihr anfängliches Referenzgewicht sein
es_es: Este será tu peso de referencia inicial
fr_fr: Ce sera votre poids de référence initial
ja: これがあなたの初期参照体重になります
ko: 이것이 당신의 초기 기준 체중이 됩니다
zh_hans: 这将是您的初始参考体重
zh_hant: 這將是您的初始參考體重

# weight_input.title
source: Daily Weight Tracker Log
de_de: Gewicht erfassen
es_es: Registro de Peso
fr_fr: Enregistrer le poids
ja: 体重トラッカー記録
ko: 체중 기록
zh_hans: 体重跟踪器记录
zh_hant: 體重追蹤器記錄

# weight_input.subtitle
source: Enter your current body weight to continue your weight loss management journey
de_de: Geben Sie Ihr aktuelles Gewicht ein, um Ihren Gewichtsverlust-Fortschritt weiter zu verfolgen
es_es: Ingresa tu peso actual para continuar tu seguimiento
fr_fr: Entrez votre poids actuel pour continuer le suivi de vos progrès de perte de poids
ja: ダイエット進捗を追跡し続けるために現在の体重を入力してください
ko: 진행상황을 계속 추적하기 위해 현재 체중을 입력하세요
zh_hans: 输入您当前的体重以继续跟踪您的减肥进度
zh_hant: 輸入您當前的體重以繼續跟蹤您的減肥進度

# weight_input.field_label
source: Weight field
de_de: Gewichtsfeld
es_es: Campo de peso
fr_fr: Champ de poids
ja: 体重トラッカーフィールド
ko: 체중 필드
zh_hans: 体重跟踪器字段
zh_hant: 體重追蹤器字段

# weight_input.field_hint
source: Enter your weight in
de_de: Geben Sie Ihr Gewicht ein
es_es: Ingresa tu peso en
fr_fr: Entrez votre poids en
ja: 体重をトラッカーに入力
ko: 체중을 입력하세요
zh_hans: 输入您的体重到跟踪器
zh_hant: 輸入您的體重到追蹤器

# weight_input.loading
source: Loading...
de_de: Lädt...
es_es: Cargando...
fr_fr: Chargement...
ja: 読み込み中...
ko: 로딩 중...
zh_hans: 加载中...
zh_hant: 載入中...

# weight_input.unit_label
source: unit
de_de: Einheit
es_es: unidad
fr_fr: unité
ja: 単位
ko: 단위
zh_hans: 单位
zh_hant: 單位

# weight_input.weight_unit
source: Weight Unit
de_de: Gewichtseinheit
es_es: Unidad de Peso
fr_fr: Unité de Poids
ja: 体重単位
ko: 체중 단위
zh_hans: 体重单位
zh_hant: 體重單位

# weight_input.invalid_weight
source: Enter a valid weight
de_de: Geben Sie ein gültiges Gewicht ein (20-300 kg oder 44-660 lb)
es_es: Ingresa un peso válido
fr_fr: Plage de poids invalide
ja: 有効な体重範囲
ko: 유효한 체중 범위
zh_hans: 输入有效体重
zh_hant: 有效體重範圍

# weight_input.date_label
source: Record date
de_de: Erfassungsdatum
es_es: Fecha de registro
fr_fr: Date d'enregistrement
ja: 記録日
ko: 기록 날짜
zh_hans: 记录日期
zh_hant: 記錄日期

# weight_input.today_button
source: Today
de_de: Heute
es_es: Hoy
fr_fr: Aujourd'hui
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

# weight_input.today_accessibility
source: Select today's date
de_de: Heutiges Datum auswählen
es_es: Seleccionar fecha de hoy
fr_fr: Sélectionner la date d'aujourd'hui
ja: 今日の日付を選択
ko: 오늘 날짜 선택
zh_hans: 选择今天的日期
zh_hant: 選擇今天的日期
