Repository: powfuu/weight-tracker
Catalog: Weight Progress Tracker/*.lproj/Localizable.strings
Languages: de_de, es_es, fr_fr, ja, ko, zh_hans, zh_hant

source: Daily reminders
de_de: Tägliche Erinnerungen
es_es: Recordatorios diarios
fr_fr: Rappels quotidiens
ja: 毎日のリマインダー
ko: 매일 알림
zh_hans: 每日提醒
zh_hant: 每日提醒

# daily_reminders_desc
source: Receive gentle reminders to log your weight
de_de: Erhalten Sie sanfte Erinnerungen zur Gewichtserfassung
es_es: Recibe recordatorios suaves para registrar tu peso
fr_fr: Recevez des rappels doux pour enregistrer votre poids
ja: 体重記録のための優しいリマインダーを受け取る
ko: 체중 기록을 위한 부드러운 알림을 받으세요
zh_hans: 接收温和的体重记录提醒
zh_hant: 接收溫和的體重記錄提醒

source: Reminder time
de_de: Erinnerungszeit
es_es: Hora del recordatorio
fr_fr: Heure du rappel
ja: リマインダーの時間
ko: 알림 시간
zh_hans: 提醒时间
zh_hant: 提醒時間

# reminder_info
source: Reminders are sent only if you haven't logged your weight that day
de_de: Erinnerungen werden nur gesendet, wenn Sie Ihr Gewicht an diesem Tag noch nicht erfasst haben
es_es: Los recordatorios se envían solo si no has registrado tu peso ese día
fr_fr: Les rappels ne sont envoyés que si vous n'avez pas enregistré votre poids ce jour-là
ja: リマインダーはその日に体重を記録していない場合のみ送信されます
ko: 그날 체중을 기록하지 않은 경우에만 알림이 전송됩니다
zh_hans: 只有在当天未记录体重时才会发送提醒
zh_hant: 只有在當天未記錄體重時才會發送提醒

source: Data
de_de: Daten
es_es: Datos
fr_fr: Données
ja: データ
ko: 데이터
zh_hans: 数据
zh_hant: 資料

source: Delete all data
de_de: Alle Daten löschen
es_es: Eliminar todos los datos
fr_fr: Supprimer toutes les données
ja: すべてのデータを削除
ko: 모든 데이터 삭제
zh_hans: 删除所有数据
zh_hant: 刪除所有資料

# delete_all_data_desc
source: This action cannot be undone
de_de: Diese Aktion kann nicht rückgängig gemacht werden
es_es: Esta acción no se puede deshacer
fr_fr: Cette action ne peut pas être annulée
ja: この操作は元に戻すことができません
ko: 이 작업은 되돌릴 수 없습니다
zh_hans: 此操作无法撤销
zh_hant: 此操作無法撤銷

source: Information
de_de: Informationen
es_es: Información
fr_fr: Informations
ja: 情報
ko: 정보
zh_hans: 信息
zh_hant: 資訊

source: Version
es_es: Versión
ja: バージョン
ko: 버전
zh_hans: 版本
zh_hant: 版本

source: Privacy Policy
de_de: Datenschutzrichtlinie
es_es: Política de privacidad
fr_fr: Politique de confidentialité
ja: プライバシーポリシー
ko: 개인정보 보호정책
zh_hans: 隐私政策
zh_hant: 隱私政策

source: Terms of Use
de_de: Nutzungsbedingungen
es_es: Términos de uso
fr_fr: Conditions d'utilisation
ja: 利用規約
ko: 이용약관
zh_hans: 使用条款
zh_hant: 使用條款

source: Delete Data
de_de: Daten löschen
es_es: Eliminar Datos
fr_fr: Supprimer les données
ja: データを削除
ko: 데이터 삭제
zh_hans: 删除数据
zh_hant: 刪除資料

# delete_data_confirm
source: Are you sure you want to delete all your data? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie alle Ihre Daten löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es_es: ¿Estás seguro de que quieres eliminar todos tus datos? Esta acción no se puede deshacer.
fr_fr: Êtes-vous sûr de vouloir supprimer toutes vos données ? Cette action ne peut pas être annulée.
ja: すべてのデータを削除してもよろしいですか？この操作は元に戻すことができません。
ko: 모든 데이터를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh_hans: 您确定要删除所有数据吗？此操作无法撤销。
zh_hant: 您確定要刪除所有資料嗎？此操作無法撤銷。

# notification_permission_error
source: Could not get permission to send notifications
de_de: Berechtigung zum Senden von Benachrichtigungen konnte nicht erhalten werden
es_es: No se pudo obtener permiso para enviar notificaciones
fr_fr: Impossible d'obtenir l'autorisation d'envoyer des notifications
ja: 通知送信の許可を取得できませんでした
ko: 알림 전송 권한을 얻을 수 없습니다
zh_hans: 无法获得发送通知的权限
zh_hant: 無法獲得發送通知的權限

# delete_data_error
source: Could not delete data
de_de: Daten konnten nicht gelöscht werden
es_es: No se pudieron eliminar los datos
fr_fr: Impossible de supprimer les données
ja: データを削除できませんでした
ko: 데이터를 삭제할 수 없습니다
zh_hans: 无法删除数据
zh_hant: 無法刪除資料

source: Terms and conditions
de_de: Geschäftsbedingungen
es_es: Términos y condiciones
fr_fr: Termes et conditions
ja: 利用規約と条件
ko: 약관 및 조건
zh_hans: 条款和条件
zh_hant: 條款和條件

source: Acceptance of terms
de_de: Annahme der Bedingungen
es_es: Aceptación de términos
fr_fr: Acceptation des termes
ja: 規約の承諾
ko: 약관 동의
zh_hans: 接受条款
zh_hant: 接受條款

# acceptance_of_terms_desc
source: By using Weight Progress Tracker, you accept these terms of use. If you do not agree with any of these terms, do not use the application.
de_de: Durch die Nutzung von Weight Progress Tracker akzeptieren Sie diese Nutzungsbedingungen. Wenn Sie mit diesen Bedingungen nicht einverstanden sind, verwenden Sie die Anwendung nicht.
es_es: Al usar Weight Progress Tracker, aceptas estos términos de uso. Si no estás de acuerdo con alguno de estos términos, no uses la aplicación.
fr_fr: En utilisant Weight Progress Tracker, vous acceptez ces conditions d'utilisation. Si vous n'êtes pas d'accord avec ces termes, n'utilisez pas l'application.
ja: Weight Progress Trackerを使用することで、これらの利用規約に同意したものとみなされます。これらの規約に同意しない場合は、アプリケーションを使用しないでください。
ko: Weight Progress Tracker를 사용함으로써 이러한 이용 약관에 동의하는 것입니다. 이 약관에 동의하지 않으시면 애플리케이션을 사용하지 마십시오.
zh_hans: 使用Weight Progress Tracker即表示您接受这些使用条款。如果您不同意这些条款，请勿使用此应用程序。
zh_hant: 使用Weight Progress Tracker即表示您接受這些使用條款。如果您不同意這些條款，請勿使用此應用程式。

# app_usage
source: Application usage
de_de: Anwendungsnutzung
es_es: Uso de la aplicación
fr_fr: Utilisation de l'application
ja: アプリケーションの使用
ko: 애플리케이션 사용
zh_hans: 应用程序使用
zh_hant: 應用程式使用

# app_usage_desc
source: Weight Progress Tracker is designed for personal body weight tracking. The application is for informational purposes only and should not be considered professional medical advice.
de_de: Weight Progress Tracker ist für die persönliche Verfolgung des Körpergewichts konzipiert. Die Anwendung dient nur zu Informationszwecken und sollte nicht als professionelle medizinische Beratung betrachtet werden.
es_es: Weight Progress Tracker está diseñado para el seguimiento personal del peso corporal. La aplicación es solo para fines informativos y no debe considerarse como consejo médico profesional.
fr_fr: Weight Progress Tracker est conçu pour le suivi personnel du poids corporel. L'application est à des fins informatives uniquement et ne doit pas être considérée comme un conseil médical professionnel.
ja: Weight Progress Trackerは個人の体重追跡のために設計されています。このアプリケーションは情報提供のみを目的としており、専門的な医学的アドバイスとして考慮されるべきではありません。
ko: Weight Progress Tracker는 개인 체중 추적을 위해 설계되었습니다. 이 애플리케이션은 정보 제공 목적으로만 사용되며 전문적인 의학적 조언으로 간주되어서는 안 됩니다.
zh_hans: Weight Progress Tracker专为个人体重跟踪而设计。此应用程序仅供信息用途，不应被视为专业医疗建议。
zh_hant: Weight Progress Tracker專為個人體重追蹤而設計。此應用程式僅供資訊用途，不應被視為專業醫療建議。

source: User responsibility
de_de: Benutzerverantwortung
es_es: Responsabilidad del usuario
fr_fr: Responsabilité de l'utilisateur
ja: ユーザーの責任
ko: 사용자 책임
zh_hans: 用户责任
zh_hant: 用戶責任

# user_responsibility_desc
source: You are responsible for the accuracy of the data you enter. The application does not verify the accuracy of the information provided and is not responsible for decisions made based on this data.
de_de: Sie sind für die Genauigkeit der von Ihnen eingegebenen Daten verantwortlich. Die Anwendung überprüft nicht die Richtigkeit der bereitgestellten Informationen und ist nicht verantwortlich für Entscheidungen, die auf diesen Daten basieren.
es_es: Eres responsable de la precisión de los datos que ingreses. La aplicación no verifica la exactitud de la información proporcionada y no es responsable de las decisiones tomadas basadas en estos datos.
fr_fr: Vous êtes responsable de l'exactitude des données que vous saisissez. L'application ne vérifie pas l'exactitude des informations fournies et n'est pas responsable des décisions prises sur la base de ces données.
ja: 入力するデータの正確性についてはユーザーが責任を負います。アプリケーションは提供された情報の正確性を検証せず、これらのデータに基づいて行われた決定について責任を負いません。
ko: 입력하는 데이터의 정확성에 대해서는 사용자가 책임집니다. 애플리케이션은 제공된 정보의 정확성을 검증하지 않으며 이러한 데이터를 기반으로 한 결정에 대해 책임지지 않습니다.
zh_hans: 您对输入数据的准确性负责。应用程序不验证所提供信息的准确性，对基于这些数据做出的决定不承担责任。
zh_hant: 您對輸入數據的準確性負責。應用程式不驗證所提供資訊的準確性，對基於這些數據做出的決定不承擔責任。

source: Limitations of liability
de_de: Haftungsbeschränkungen
es_es: Limitaciones de responsabilidad
fr_fr: Limitations de responsabilité
ja: 責任の制限
ko: 책임 제한
zh_hans: 责任限制
zh_hant: 責任限制

# limitations_of_liability_desc
source: Weight Progress Tracker is provided 'as is'. We do not guarantee that the application is error-free or will function without interruptions. We are not responsible for data loss or damages arising from the use of the application.
de_de: Weight Progress Tracker wird 'wie besehen' bereitgestellt. Wir garantieren nicht, dass die Anwendung fehlerfrei ist oder ohne Unterbrechungen funktioniert. Wir sind nicht verantwortlich für Datenverluste oder Schäden, die durch die Nutzung der Anwendung entstehen.
es_es: Weight Progress Tracker se proporciona 'tal como está'. No garantizamos que la aplicación esté libre de errores o funcione sin interrupciones. No somos responsables de la pérdida de datos o daños derivados del uso de la aplicación.
fr_fr: Weight Progress Tracker est fourni 'tel quel'. Nous ne garantissons pas que l'application soit exempte d'erreurs ou fonctionne sans interruptions. Nous ne sommes pas responsables de la perte de données ou des dommages résultant de l'utilisation de l'application.
ja: Weight Progress Trackerは「現状のまま」提供されます。アプリケーションがエラーフリーであることや中断なく機能することを保証しません。アプリケーションの使用から生じるデータ損失や損害について責任を負いません。
ko: Weight Progress Tracker는 '있는 그대로' 제공됩니다. 애플리케이션이 오류 없이 작동하거나 중단 없이 기능할 것을 보장하지 않습니다. 애플리케이션 사용으로 인한 데이터 손실이나 손해에 대해 책임지지 않습니다.
zh_hans: Weight Progress Tracker按现状提供。我们不保证应用程序无错误或不间断运行。我们对使用应用程序导致的数据丢失或损害不承担责任。
zh_hant: Weight Progress Tracker按「現狀」提供。我們不保證應用程式無錯誤或不間斷運行。我們對使用應用程式導致的數據丟失或損害不承擔責任。

source: Medical advice
de_de: Medizinische Beratung
es_es: Consejo médico
fr_fr: Conseil médical
ja: 医学的アドバイス
ko: 의학적 조언
zh_hans: 医疗建议
zh_hant: 醫療建議

# medical_advice_desc
source: This application does not provide medical advice. Always consult with a healthcare professional before making important decisions about your weight or health. Do not use this application as a substitute for professional medical care.
de_de: Diese Anwendung bietet keine medizinische Beratung. Konsultieren Sie immer einen Gesundheitsexperten, bevor Sie wichtige Entscheidungen über Ihr Gewicht oder Ihre Gesundheit treffen. Verwenden Sie diese Anwendung nicht als Ersatz für professionelle medizinische Versorgung.
es_es: Esta aplicación no proporciona consejo médico. Siempre consulta con un profesional de la salud antes de tomar decisiones importantes sobre tu peso o salud. No uses esta aplicación como sustituto de atención médica profesional.
fr_fr: Cette application ne fournit pas de conseil médical. Consultez toujours un professionnel de la santé avant de prendre des décisions importantes concernant votre poids ou votre santé. N'utilisez pas cette application comme substitut aux soins médicaux professionnels.
ja: このアプリケーションは医学的アドバイスを提供しません。体重や健康に関する重要な決定を行う前に、常に医療専門家に相談してください。このアプリケーションを専門的な医療ケアの代替として使用しないでください。
ko: 이 애플리케이션은 의학적 조언을 제공하지 않습니다. 체중이나 건강에 관한 중요한 결정을 내리기 전에 항상 의료 전문가와 상담하십시오. 이 애플리케이션을 전문적인 의료 서비스의 대체품으로 사용하지 마십시오.
zh_hans: 此应用程序不提供医疗建议。在对您的体重或健康做出重要决定之前，请务必咨询医疗专业人员。请勿将此应用程序用作专业医疗护理的替代品。
zh_hant: 此應用程式不提供醫療建議。在對您的體重或健康做出重要決定之前，請務必諮詢醫療專業人員。請勿將此應用程式用作專業醫療護理的替代品。

source: Intellectual property
de_de: Geistiges Eigentum
es_es: Propiedad intelectual
fr_fr: Propriété intellectuelle
ja: 知的財産
ko: 지적 재산권
zh_hans: 知识产权
zh_hant: 知識產權

# intellectual_property_desc
source: All rights to the Weight Progress Tracker application are reserved. You may not copy, modify, distribute, or create derivative works from the application without express authorization.
de_de: Alle Rechte an der Weight Progress Tracker-Anwendung sind vorbehalten. Sie dürfen die Anwendung ohne ausdrückliche Genehmigung nicht kopieren, modifizieren, verteilen oder abgeleitete Werke erstellen.
es_es: Todos los derechos de la aplicación Weight Progress Tracker están reservados. No puedes copiar, modificar, distribuir o crear trabajos derivados de la aplicación sin autorización expresa.
fr_fr: Tous les droits de l'application Weight Progress Tracker sont réservés. Vous ne pouvez pas copier, modifier, distribuer ou créer des œuvres dérivées de l'application sans autorisation expresse.
ja: Weight Progress Trackerアプリケーションのすべての権利は留保されています。明示的な許可なしに、アプリケーションをコピー、変更、配布、または派生作品を作成することはできません。
ko: Weight Progress Tracker 애플리케이션의 모든 권리는 보유됩니다. 명시적인 승인 없이 애플리케이션을 복사, 수정, 배포하거나 파생 작품을 만들 수 없습니다.
zh_hans: Weight Progress Tracker应用程序的所有权利均予保留。未经明确授权，您不得复制、修改、分发或创建应用程序的衍生作品。
zh_hant: Weight Progress Tracker應用程式的所有權利均予保留。未經明確授權，您不得複製、修改、分發或創建應用程式的衍生作品。

source: Modifications
de_de: Änderungen
es_es: Modificaciones
ja: 変更
ko: 수정
zh_hans: 修改
zh_hant: 修改

# modifications_desc
source: We reserve the right to modify these terms at any time. Updates will be reflected in the 'last updated' date. Continued use of the application constitutes acceptance of the modified terms.
de_de: Wir behalten uns das Recht vor, diese Bedingungen jederzeit zu ändern. Aktualisierungen werden im Datum 'zuletzt aktualisiert' widergespiegelt. Die fortgesetzte Nutzung der Anwendung stellt die Annahme der geänderten Bedingungen dar.
es_es: Nos reservamos el derecho de modificar estos términos en cualquier momento. Las actualizaciones se reflejarán en la fecha de 'última actualización'. El uso continuado de la aplicación constituye la aceptación de los términos modificados.
fr_fr: Nous nous réservons le droit de modifier ces termes à tout moment. Les mises à jour seront reflétées dans la date de 'dernière mise à jour'. L'utilisation continue de l'application constitue l'acceptation des termes modifiés.
ja: これらの規約をいつでも変更する権利を留保します。更新は「最終更新日」に反映されます。アプリケーションの継続使用は、変更された規約の承諾を構成します。
ko: 언제든지 이러한 약관을 수정할 권리를 보유합니다. 업데이트는 '마지막 업데이트' 날짜에 반영됩니다. 애플리케이션의 지속적인 사용은 수정된 약관의 수락을 의미합니다.
zh_hans: 我们保留随时修改这些条款的权利。更新将反映在最后更新日期中。继续使用应用程序即表示接受修改后的条款。
zh_hant: 我們保留隨時修改這些條款的權利。更新將反映在「最後更新」日期中。繼續使用應用程式即表示接受修改後的條款。

source: Termination
de_de: Beendigung
es_es: Terminación
fr_fr: Résiliation
ja: 終了
ko: 종료
zh_hans: 终止
zh_hant: 終止

# termination_desc
source: You may stop using the application at any time by deleting it from your device. We reserve the right to discontinue the application or its services at any time.
de_de: Sie können die Nutzung der Anwendung jederzeit beenden, indem Sie sie von Ihrem Gerät löschen. Wir behalten uns das Recht vor, die Anwendung oder ihre Dienste jederzeit einzustellen.
es_es: Puedes dejar de usar la aplicación en cualquier momento eliminándola de tu dispositivo. Nos reservamos el derecho de discontinuar la aplicación o sus servicios en cualquier momento.
fr_fr: Vous pouvez arrêter d'utiliser l'application à tout moment en la supprimant de votre appareil. Nous nous réservons le droit d'interrompre l'application ou ses services à tout moment.
ja: デバイスからアプリケーションを削除することで、いつでも使用を停止できます。アプリケーションまたはそのサービスをいつでも中止する権利を留保します。
ko: 기기에서 애플리케이션을 삭제하여 언제든지 사용을 중단할 수 있습니다. 언제든지 애플리케이션이나 서비스를 중단할 권리를 보유합니다.
zh_hans: 您可以随时通过从设备中删除应用程序来停止使用。我们保留随时停止应用程序或其服务的权利。
zh_hant: 您可以隨時通過從設備中刪除應用程式來停止使用。我們保留隨時停止應用程式或其服務的權利。

source: Contact
de_de: Kontakt
es_es: Contacto
ja: お問い合わせ
ko: 연락처
zh_hans: 联系
zh_hant: 聯絡

# contact_desc
source: If you have questions about this privacy policy, you can contact us through the App Store or available support channels.
de_de: Wenn Sie Fragen zu dieser Datenschutzrichtlinie haben, können Sie uns über den App Store oder verfügbare Support-Kanäle kontaktieren.
es_es: Si tienes preguntas sobre esta política de privacidad, puedes contactarnos a través de la App Store o canales de soporte disponibles.
fr_fr: Si vous avez des questions sur cette politique de confidentialité, vous pouvez nous contacter via l'App Store ou les canaux de support disponibles.
ja: このプライバシーポリシーについてご質問がある場合は、App Storeまたは利用可能なサポートチャンネルを通じてお問い合わせください。
ko: 지원이나 피드백을 위해 연락하세요
zh_hans: 如果您对此隐私政策有任何疑问，可以通过App Store或可用的支持渠道联系我们。
zh_hant: 如果您對此隱私政策有任何疑問，可以通過App Store或可用的支援管道聯絡我們。

source: New Goal
de_de: Neues Ziel
es_es: Nuevo Objetivo de Pérdida de Peso
fr_fr: Nouvel objectif
ja: 新しい目標
ko: 새 목표
zh_hans: 新目标
zh_hant: 新目標

# goal_subtitle
source: Set a realistic and achievable weight loss goal to stay motivated in your tracker
de_de: Setzen Sie sich ein realistisches und erreichbares Ziel, um motiviert zu bleiben
es_es: Establece una meta realista de pérdida de peso para mantenerte motivado en tu tracker
fr_fr: Fixez-vous un objectif réaliste et réalisable pour rester motivé
ja: モチベーションを維持するために現実的で達成可能な目標を設定しましょう
ko: 목표 부제목
zh_hans: 设置现实且可实现的减重目标以在您的跟踪器中保持动力
zh_hant: 設置現實且可達成的目標以保持動力

source: Goal type
de_de: Zieltyp
es_es: Tipo de objetivo de peso
fr_fr: Type d'objectif
ja: 目標タイプ
ko: 목표 유형
zh_hans: 目标类型
zh_hant: 目標類型

source: Target weight
de_de: Zielgewicht
es_es: Peso objetivo
fr_fr: Poids cible
ja: 目標体重
ko: 목표 체중
zh_hans: 目标体重
zh_hant: 目標體重

source: Goal summary
de_de: Zielzusammenfassung
es_es: Resumen del objetivo
fr_fr: Résumé de l'objectif
ja: 目標の概要
ko: 목표 요약
zh_hans: 目标摘要
zh_hant: 目標摘要

source: Create
de_de: Erstellen
es_es: Crear
fr_fr: Créer
ja: 作成
ko: 생성
zh_hans: 创建
zh_hant: 創建

source: Error creating goal
de_de: Fehler beim Erstellen des Ziels
es_es: Error al crear el objetivo
fr_fr: Erreur lors de la création de l'objectif
ja: 目標の作成中にエラーが発生しました
ko: 목표 생성 중 오류가 발생했습니다
zh_hans: 创建目标时出错
zh_hant: 創建目標時出錯

# time_to_log_weight
source: Time to log your weight!
de_de: Zeit, Ihr Gewicht zu erfassen!
es_es: ¡Es hora de registrar tu peso!
fr_fr: Il est temps d'enregistrer votre poids !
ja: 体重を記録する時間です！
ko: 체중을 기록할 시간입니다!
zh_hans: 是时候记录你的体重了！
zh_hant: 是時候記錄您的體重了！

source: View details
de_de: Details anzeigen
es_es: Ver detalles
fr_fr: Voir les détails
ja: 詳細を見る
ko: 세부 정보 보기
zh_hans: 查看详情
zh_hant: 查看詳情

# period_example
source: Period (e.g. "7 days")
de_de: Zeitraum (z.B. "7 Tage")
es_es: Período (ej. "7 días")
fr_fr: Période (ex. "7 jours")
ja: 期間（例："7日間"）
ko: 기간 (예: "7일")
zh_hans: 时期（例如"7天"）
zh_hant: 時期（例如"7天"）

# weight_placeholder
source: e.g. 70.5
de_de: z.B. 70,5
es_es: Ej: 70.5
fr_fr: ex. 70,5
ja: 例：70.5
ko: 예: 70.5
zh_hans: 例：70.5
zh_hant: 例：70.5

source: unit
de_de: Einheit
es_es: unidad
fr_fr: Unité
ja: 単位
ko: 단위
zh_hans: 单位
zh_hant: 單位

# enter_valid_weight_range
source: Enter a valid weight (1-500 kg)
de_de: Geben Sie ein gültiges Gewicht ein (1-500 kg)
es_es: Ingresa un peso válido (1-500 kg)
fr_fr: Entrez un poids valide (1-500 kg)
ja: 有効な体重を入力してください（1-500キロ）
ko: 유효한 체중을 입력하세요 (1-500킬로)
zh_hans: 请输入有效体重（1-500公斤）
zh_hant: 請輸入有效體重（1-500公斤）

# enter_valid_weight_range_format
source: Enter a valid weight (1-500 %@)
de_de: Geben Sie ein gültiges Gewicht ein (1-500 %@)
es_es: Ingresa un peso válido (1-500 %@)
fr_fr: Entrez un poids valide (1-500 %@)
ja: 有効な体重を入力してください（1-500 %@）
ko: 유효한 체중을 입력하세요 (1-500 %@)
zh_hant: 請輸入有效體重（1-500 %@）

# goal_25_completed
source: 25% Goal Achieved!
de_de: 25% des Ziels erreicht!
es_es: ¡25% del Objetivo Alcanzado!
fr_fr: 25% de l'objectif atteint !
ja: 25%目標達成！
ko: 25% 목표 달성!
zh_hans: 25%目标达成！
zh_hant: 目標25%完成

# goal_25_completed_desc
source: Great start! You're 25% closer to your goal.
de_de: Großartiger Start! Sie sind 25% näher an Ihrem Ziel.
es_es: ¡Buen comienzo! Estás 25% más cerca de tu objetivo.
fr_fr: Excellent début ! Vous êtes 25% plus proche de votre objectif.
ja: 素晴らしいスタート！目標の25%に近づきました。
ko: 훌륭한 시작! 목표의 25%에 가까워졌습니다.
zh_hans: 很好的开始！您距离目标又近了25%。
zh_hant: 您已完成目標的25%！

# goal_50_completed
source: Halfway There!
de_de: Halbzeit!
es_es: ¡A Mitad de Camino!
fr_fr: À mi-chemin !
ja: 半分達成！
ko: 절반 달성!
zh_hans: 完成一半！
zh_hant: 目標50%完成

# goal_50_completed_desc
source: Amazing progress! You've reached 50% of your goal.
de_de: Erstaunlicher Fortschritt! Sie haben 50% Ihres Ziels erreicht.
es_es: ¡Progreso increíble! Has alcanzado el 50% de tu objetivo.
fr_fr: Progrès incroyable ! Vous avez atteint 50% de votre objectif.
ja: 素晴らしい進歩！目標の50%に到達しました。
ko: 훌륭한 진전! 목표의 50%에 도달했습니다.
zh_hans: 惊人的进步！您已经达到了目标的50%。
zh_hant: 您已完成目標的一半！

# goal_75_completed
source: 75% Complete!
de_de: 75% abgeschlossen!
es_es: ¡75% Completado!
fr_fr: 75% terminé !
ja: 75%完了！
ko: 75% 완료!
zh_hans: 75%完成！
zh_hant: 目標75%完成

# goal_75_completed_desc
source: You're almost there! Only 25% left to go.
de_de: Sie sind fast da! Nur noch 25% zu gehen.
es_es: ¡Ya casi llegas! Solo queda el 25%.
fr_fr: Vous y êtes presque ! Il ne reste que 25%.
ja: もうすぐです！残り25%です。
ko: 거의 다 왔습니다! 25%만 남았습니다.
zh_hans: 您快到了！只剩下25%了。
zh_hant: 您已完成目標的75%！

# goal_completed
source: Goal Achieved!
de_de: Ziel erreicht!
es_es: ¡Objetivo Alcanzado!
fr_fr: Objectif atteint !
ja: 目標達成！
ko: 목표 달성!
zh_hans: 目标达成！
zh_hant: 目標達成！

# goal_completed_desc
source: Congratulations! You've reached your weight goal of %@ %@!
de_de: Herzlichen Glückwunsch! Sie haben Ihr Gewichtsziel von %@ %@ erreicht!
es_es: ¡Felicitaciones! Has alcanzado tu objetivo de peso de %@ %@!
fr_fr: Félicitations ! Vous avez atteint votre objectif de poids de %@ %@ !
ja: おめでとうございます！%@ %@の体重目標に到達しました！
ko: 축하합니다! %@ %@의 체중 목표에 도달했습니다!
zh_hans: 恭喜！您已经达到了%@ %@的体重目标！
zh_hant: 恭喜！您已經達到了%@ %@的體重目標！

# goal_completed_notification_title
source: ðŸŽ‰ Goal Achieved!
de_de: 🎉 Ziel erreicht!
es_es: 🎉 ¡Objetivo Alcanzado!
fr_fr: 🎉 Objectif atteint !
ko: 🎉 목표 달성!
zh_hant: 🎉 目標達成！

# goal_completed_notification_body
source: Congratulations! You've successfully reached your weight goal. Keep up the great work!
de_de: Herzlichen Glückwunsch! Sie haben Ihr Gewichtsziel erfolgreich erreicht. Weiter so!
es_es: ¡Felicitaciones! Has alcanzado exitosamente tu objetivo de peso. ¡Sigue así!
fr_fr: Félicitations ! Vous avez atteint avec succès votre objectif de poids. Continuez comme ça !
ko: 축하합니다! 체중 목표를 성공적으로 달성했습니다. 계속 화이팅하세요!
zh_hant: 恭喜！您已成功達到體重目標。繼續保持！

# streak_3_days
source: 3-Day Streak!
de_de: 3-Tage-Serie!
es_es: ¡Racha de 3 Días!
fr_fr: Série de 3 jours !
ja: 3日連続！
ko: 3일 연속!
zh_hans: 3天连续记录！
zh_hant: 3天連續記錄

# streak_3_days_desc
source: Keep it up! You've logged weight for 3 days in a row.
de_de: Weiter so! Sie haben 3 Tage in Folge Gewicht erfasst.
es_es: ¡Sigue así! Has registrado peso por 3 días consecutivos.
fr_fr: Continuez ! Vous avez enregistré votre poids pendant 3 jours consécutifs.
ja: その調子です！3日連続で体重を記録しました。
ko: 잘하고 있어요! 3일 연속 체중을 기록했습니다.
zh_hans: 继续保持！您已经连续3天记录体重了。
zh_hant: 連續3天記錄體重！

# streak_7_days
source: Week Streak!
de_de: Wochen-Serie!
es_es: ¡Racha de una Semana!
fr_fr: Série d'une semaine !
ja: 1週間連続！
ko: 1주일 연속!
zh_hans: 一周连续记录！
zh_hant: 7天連續記錄

# streak_7_days_desc
source: You're on fire! Keep up the great work!
de_de: Sie sind in Fahrt! Machen Sie weiter so!
es_es: ¡Estás en llamas! ¡Sigue con el gran trabajo!
fr_fr: Vous êtes en feu ! Continuez ce bon travail !
ja: 絶好調です！素晴らしい仕事を続けてください！
ko: 훌륭합니다! 계속 좋은 일을 하세요!
zh_hans: 您太棒了！继续保持这种出色的工作！
zh_hant: 連續一週記錄體重！

# streak_14_days
source: 14-Day Streak!
de_de: 14-Tage-Serie!
es_es: ¡Racha de 14 Días!
fr_fr: Série de 14 jours !
ja: 14日連続！
ko: 14일 연속!
zh_hans: 14天连续记录！
zh_hant: 14天連續記錄

# streak_14_days_desc
source: Two weeks of consistency! You're building a strong habit.
de_de: Zwei Wochen Beständigkeit! Sie bauen eine starke Gewohnheit auf.
es_es: ¡Dos semanas de constancia! Estás construyendo un hábito sólido.
fr_fr: Deux semaines de cohérence ! Vous construisez une habitude solide.
ja: 2週間の一貫性！強い習慣を築いています。
ko: 2주간의 일관성! 강한 습관을 만들고 있습니다.
zh_hans: 两周的坚持！您正在建立一个强大的习惯。
zh_hant: 連續兩週記錄體重！

# streak_30_days
source: 30-Day Streak!
de_de: 30-Tage-Serie!
es_es: ¡Racha de 30 Días!
fr_fr: Série de 30 jours !
ja: 30日連続！
ko: 30일 연속!
zh_hans: 30天连续记录！
zh_hant: 30天連續記錄

# streak_30_days_desc
source: A full month of dedication! You're unstoppable.
de_de: Ein ganzer Monat der Hingabe! Sie sind unaufhaltsam.
es_es: ¡Un mes completo de dedicación! Eres imparable.
fr_fr: Un mois complet de dévouement ! Vous êtes inarrêtable.
ja: 1ヶ月間の献身！あなたは止められません。
ko: 한 달간의 헌신! 당신을 막을 수 없습니다.
zh_hans: 整整一个月的坚持！您势不可挡。
zh_hant: 連續一個月記錄體重！

# streak_60_days
source: 60-Day Streak!
de_de: 60-Tage-Serie!
es_es: ¡Racha de 60 Días!
fr_fr: Série de 60 jours !
ja: 60日連続！
ko: 60일 연속!
zh_hans: 60天连续记录！
zh_hant: 60天連續記錄
