Repository: powfuu/weight-tracker
Catalog: Weight Progress Tracker/*.lproj/Localizable.strings
Languages: de_de, es_es, fr_fr, ja, ko, zh_hans, zh_hant

source: No weight data available
de_de: Keine Gewichtsdaten verfügbar, um sie im Diagramm anzuzeigen
es_es: No hay datos de peso disponibles para mostrar en el gráfico
fr_fr: Aucune donnée de poids disponible pour afficher dans le graphique
ja: グラフに表示する体重データがありません
ko: 차트에 표시할 체중 데이터가 없습니다
zh_hans: 没有可用的体重数据显示在图表中
zh_hant: 沒有可用的體重數據顯示在圖表中

source: Objective
de_de: Ziel
es_es: Objetivo
fr_fr: Objectif
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

# three_days
source: 3 days
de_de: 3 Tage
es_es: 3 días
fr_fr: 3 jours
ja: 3日間
ko: 3일
zh_hant: 3天

# seven_days
source: 7 days
de_de: 7 Tage
es_es: 7 días
fr_fr: 7 jours
ja: 7日間
ko: 7일
zh_hans: 7天
zh_hant: 7 天

# thirty_days
source: 30 days
de_de: 30 Tage
es_es: 30 días
fr_fr: 30 jours
ja: 30日間
ko: 30일
zh_hans: 30天
zh_hant: 30 天

# six_months
source: 6 months
de_de: 6 Monate
es_es: 6 meses
fr_fr: 6 mois
ja: 6ヶ月
ko: 6개월
zh_hant: 6個月

# ninety_days
source: 90 days
de_de: 90 Tage
es_es: 90 días
fr_fr: 90 jours
ja: 90日間
ko: 90일
zh_hans: 90天
zh_hant: 90 天

# one_year
source: 1 year
de_de: 1 Jahr
es_es: 1 año
fr_fr: 1 an
ja: 1年間
ko: 1년
zh_hans: 1年
zh_hant: 1 年

# in_ninety_days
source: in 90 days
de_de: in 90 Tagen
es_es: en 90 días
fr_fr: dans 90 jours
ja: 90日後
ko: 90일 후
zh_hans: 90天内
zh_hant: 90 天內

source: this year
de_de: dieses Jahr
es_es: este año
fr_fr: cette année
ja: 今年
ko: 올해
zh_hans: 今年
zh_hant: 今年

# goal_progress_title
source: Goal Progress
de_de: Zielfortschritt
es_es: Progreso del objetivo
fr_fr: Progrès de l'objectif
ja: 目標進捗
ko: 목표 진행상황
zh_hans: 目标进度
zh_hant: 目標進度

# since_date
source: Since
de_de: Seit
es_es: Desde
fr_fr: Depuis
ja: 開始日
ko: 시작일
zh_hans: 自
zh_hant: 自

# current_weight_title
source: Current weight
de_de: Aktuelles Gewicht
es_es: Peso actual
fr_fr: Poids actuel
ja: 現在の体重
ko: 현재 체중
zh_hans: 当前体重
zh_hant: 當前體重

# goal_title
source: Goal
de_de: Ziel
es_es: Objetivo
fr_fr: Objectif
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

# loading_progress
source: Loading your progress
de_de: Lade Ihren Fortschritt
es_es: Cargando tu progreso
fr_fr: Chargement de vos progrès
ja: 進捗を読み込み中
ko: 진행상황을 로딩 중
zh_hans: 正在加载您的进度
zh_hant: 載入您的進度

# preparing_data
source: Preparing your data...
de_de: Bereite Ihre Daten vor...
es_es: Preparando tus datos...
fr_fr: Préparation de vos données...
ja: データを準備中...
ko: 데이터를 준비 중...
zh_hans: 正在准备您的数据...
zh_hant: 準備您的數據...

# loading_simple
source: Loading...
de_de: Lädt...
es_es: Cargando...
fr_fr: Chargement...
ja: 読み込み中...
ko: 로딩 중...
zh_hans: 加载中...
zh_hant: 載入中...

source: Loading goal data...
de_de: Lade Zieldaten...
es_es: Cargando datos del objetivo...
fr_fr: Chargement des données d'objectif...
ja: 目標データを読み込み中...
ko: 목표 데이터 로딩 중...
zh_hant: 載入目標數據中...

# great_exclamation
source: Great!
de_de: Großartig!
es_es: ¡Genial!
fr_fr: Génial !
ja: 素晴らしい！
ko: 훌륭해요!
zh_hans: 太棒了！
zh_hant: 太棒了！

# keyboard_warmup_hidden
source: KeyboardWarmupView is hidden
de_de: Tastatur ausgeblendet
es_es: KeyboardWarmupView está oculto
fr_fr: KeyboardWarmupView est masqué
ja: キーボード非表示
ko: 키보드 준비 숨김
zh_hans: 键盘预热视图已隐藏
zh_hant: 鍵盤預熱已隱藏

# last_update_label
source: Last update:
de_de: Letzte Aktualisierung
es_es: Última actualización:
fr_fr: Dernière mise à jour :
ja: 最終更新
ko: 마지막 업데이트 라벨
zh_hans: 最后更新：
zh_hant: 最後更新

# settings_button
source: Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
ja: 設定
ko: 설정 버튼
zh_hans: 设置
zh_hant: 設置

# settings_hint
source: Opens the settings screen
de_de: Öffnet den Einstellungsbildschirm
es_es: Abre la pantalla de configuración
fr_fr: Ouvrir l'écran des paramètres
ja: 設定画面を開く
ko: 설정 힌트
zh_hans: 打开设置屏幕
zh_hant: 點擊設置按鈕進行配置

# invalid_weight_range
source: Enter a valid weight (1-500 kg)
de_de: Geben Sie ein gültiges Gewicht ein (1-500 kg)
es_es: Ingresa un peso válido (1-500 kg)
fr_fr: Entrez un poids valide (1-500 kg)
ja: 有効な体重を入力してください（1-500キロ）
ko: 유효하지 않은 체중 범위
zh_hans: 输入有效体重（1-500公斤）
zh_hant: 請輸入有效體重（1-500公斤）

# goal_update_error
source: Could not update goal. Please try again.
de_de: Ziel konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es_es: No se pudo actualizar el objetivo. Inténtalo de nuevo.
fr_fr: Impossible de mettre à jour l'objectif. Veuillez réessayer.
ja: 目標を更新できませんでした。もう一度お試しください。
ko: 목표를 업데이트할 수 없습니다. 다시 시도해 주세요.
zh_hans: 无法更新目标。请重试。
zh_hant: 無法更新目標。請重試。

# goal_delete_error
source: Could not delete goal. Please try again.
de_de: Ziel konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.
es_es: No se pudo eliminar el objetivo. Inténtalo de nuevo.
fr_fr: Impossible de supprimer l'objectif. Veuillez réessayer.
ja: 目標を削除できませんでした。もう一度お試しください。
ko: 목표를 삭제할 수 없습니다. 다시 시도해 주세요.
zh_hans: 无法删除目标。请重试。
zh_hant: 無法刪除目標。請重試。

# goal_creation_error
source: Error creating goal
de_de: Fehler beim Erstellen des Ziels
es_es: Error al crear el objetivo
fr_fr: Erreur lors de la création de l'objectif
ja: 目標の作成中にエラーが発生しました：
ko: 목표 생성 중 오류가 발생했습니다:
zh_hans: 创建目标时出错：
zh_hant: 創建目標時出錯：

# goal_adjust_description
source: Adjust your goal based on your current progress to stay motivated
de_de: Passen Sie Ihr Ziel basierend auf Ihrem aktuellen Fortschritt an
es_es: Ajusta tu objetivo basándote en tu progreso actual para mantenerte motivado
fr_fr: Ajustez votre objectif en fonction de vos progrès actuels pour rester motivé
ja: モチベーションを維持するために現在の進捗に基づいて目標を調整してください
ko: 현재 진행 상황에 따라 목표를 조정하여 동기를 유지하세요
zh_hant: 根據您當前的進度調整目標以保持動力

source: Weight change
de_de: Gewichtsänderung
es_es: Cambio de peso
fr_fr: Changement de poids
ja: 体重変化
ko: 체중 변화
zh_hans: 体重变化
zh_hant: 體重變化

source: Not enough data
de_de: Nicht genügend Daten
es_es: No hay datos suficientes
fr_fr: Pas assez de données
ja: データが不足しています
ko: 데이터가 부족합니다
zh_hans: 数据不足
zh_hant: 數據不足

# last_update_accessibility
source: Last update: %@, current weight: %@
de_de: Letzte Aktualisierung: %@, aktuelles Gewicht: %@
es_es: Última actualización: %@, peso actual: %@
fr_fr: Dernière mise à jour : %@, poids actuel : %@
ja: 最終更新：%@、現在の体重：%@
ko: 마지막 업데이트: %@, 현재 체중: %@
zh_hans: 最后更新：%@，当前体重：%@
zh_hant: 最後更新：%@，當前體重：%@

source: more
de_de: mehr
es_es: más
fr_fr: plus
ja: もっと
ko: 더
zh_hans: 更多
zh_hant: 更多

source: less
de_de: weniger
es_es: menos
fr_fr: moins
ja: 少なく
ko: 적게
zh_hans: 更少
zh_hant: 更少

source: View detailed statistics
de_de: Detaillierte Statistiken anzeigen
es_es: Ver estadísticas detalladas
fr_fr: Voir les statistiques détaillées
ja: 詳細統計を表示
ko: 상세 통계 보기
zh_hans: 查看详细统计
zh_hant: 查看詳細統計

# tap_to_open_statistics
source: Tap to open full statistics view
de_de: Tippen Sie, um die vollständige Statistikansicht zu öffnen
es_es: Toca para abrir la vista de estadísticas completas
fr_fr: Appuyez pour ouvrir la vue complète des statistiques
ja: タップして完全な統計ビューを開く
ko: 탭하여 전체 통계 보기를 열기
zh_hans: 点击打开完整统计视图
zh_hant: 點擊打開完整統計視圖

# one_year_short
source: 1Y
de_de: 1J
es_es: 1A
fr_fr: 1A
ja: 1年
ko: 1년
zh_hans: 1年
zh_hant: 1年

# color_green
source: green
es_es: verde
fr_fr: vert
ja: 緑
ko: 초록색
zh_hans: 绿色
zh_hant: 綠色

# color_red
source: red
de_de: rot
es_es: rojo
fr_fr: rouge
ja: 赤
ko: 빨간색
zh_hans: 红色
zh_hant: 紅色

# color_orange
source: orange
es_es: naranja
ja: オレンジ
ko: 주황색
zh_hans: 橙色
zh_hant: 橙色

# color_blue
source: blue
de_de: blau
es_es: azul
fr_fr: bleu
ja: 青
ko: 파란색
zh_hans: 蓝色
zh_hant: 藍色

# color_purple
source: purple
de_de: lila
es_es: morado
fr_fr: violet
ja: 紫
ko: 보라색
zh_hans: 紫色
zh_hant: 紫色

# color_teal
source: teal
de_de: blaugrün
es_es: verde azulado
fr_fr: sarcelle
ja: ティール
ko: 청록색
zh_hans: 青色
zh_hant: 青色

# daily_log
source: Daily Weight Log
de_de: Tägliches Protokoll
es_es: Registro Diario de Peso
fr_fr: Journal Quotidien de Poids
ja: 日次記録
ko: 일일 기록
zh_hans: 每日体重记录
zh_hant: 每日記錄

# weight_tracking_tips
source: Tracking Tips
de_de: Tipps zur Gewichtsverfolgung
es_es: Consejos de Seguimiento
fr_fr: Conseils de Suivi
ja: 体重追跡のヒント
ko: 체중 추적 팁
zh_hans: 跟踪技巧
zh_hant: 體重追蹤技巧

# weight_tracking_tips_desc
source: Tips for accurate weight monitoring
de_de: Hilfreiche Tipps für eine genaue Gewichtsverfolgung
es_es: Consejos para un monitoreo preciso del peso
fr_fr: Conseils pour un suivi précis du poids
ja: 正確な体重追跡のための役立つヒント
ko: 정확한 추적을 위한 유용한 팁
zh_hans: 准确体重监测的技巧
zh_hant: 準確監測體重的技巧

# weight_entry_success
source: Weight Entry Successful!
de_de: Gewicht erfolgreich eingetragen
es_es: ¡Peso Registrado Exitosamente!
fr_fr: Poids Enregistré avec Succès !
ja: 体重記録成功
ko: 체중 기록 성공
zh_hans: 体重记录成功！
zh_hant: 體重記錄成功！

# weight_entry_success_desc
source: Your weight has been logged successfully.
de_de: Ihr Gewicht wurde erfolgreich gespeichert
es_es: Tu peso ha sido registrado exitosamente.
fr_fr: Votre poids a été enregistré avec succès.
ja: 体重が正常に保存されました
ko: 체중이 성공적으로 기록되었습니다
zh_hans: 您的体重已成功记录。
zh_hant: 您的體重已成功記錄。

source: Weight Updated
de_de: Gewicht aktualisiert
es_es: Peso Actualizado
fr_fr: Poids Mis à Jour
ja: 体重更新
ko: 체중 업데이트됨
zh_hans: 体重已更新
zh_hant: 體重已更新

# weight_updated_desc
source: Your weight entry has been successfully updated.
de_de: Ihr Gewicht wurde erfolgreich aktualisiert
es_es: Tu entrada de peso ha sido actualizada exitosamente.
fr_fr: Votre entrée de poids a été mise à jour avec succès.
ja: 体重が正常に更新されました
ko: 체중이 성공적으로 업데이트되었습니다
zh_hans: 您的体重记录已成功更新。
zh_hant: 您的體重記錄已成功更新。

source: Goal Created!
de_de: Ziel erstellt
es_es: ¡Objetivo Creado!
fr_fr: Objectif Créé !
ja: 目標が作成されました
ko: 목표 생성됨
zh_hans: 目标已创建！
zh_hant: 目標已創建

# goal_created_desc
source: Your goal has been set up successfully.
de_de: Ihr neues Ziel wurde erfolgreich erstellt
es_es: Tu objetivo ha sido configurado exitosamente.
fr_fr: Votre objectif a été configuré avec succès.
ja: 新しい目標が正常に作成されました
ko: 새 목표가 성공적으로 생성되었습니다
zh_hans: 您的目标已成功设置。
zh_hant: 您的目標已成功設置。

source: Goal Updated
de_de: Ziel aktualisiert
es_es: Objetivo actualizado exitosamente
fr_fr: Objectif Mis à Jour
ja: 目標が更新されました
ko: 목표 업데이트됨
zh_hans: 目标已更新
zh_hant: 目標已更新

# goal_updated_desc
source: Your goal has been updated successfully.
de_de: Ihr Ziel wurde erfolgreich aktualisiert
es_es: Tu objetivo ha sido actualizado exitosamente.
fr_fr: Votre objectif a été mis à jour avec succès.
ja: 目標が正常に更新されました
ko: 목표가 성공적으로 업데이트되었습니다
zh_hans: 您的目标已成功更新。
zh_hant: 您的目標已成功更新。

source: Define your goal!
de_de: Definieren Sie Ihr Ziel!
es_es: ¡Define tu objetivo!
fr_fr: Définissez votre objectif !
ja: 目標を設定しましょう！
ko: 목표를 정의하세요!
zh_hans: 定义您的目标！
zh_hant: 定義您的目標！

# goal_motivation_subtitle
source: Set a weight and date goal to stay motivated in your progress
de_de: Setzen Sie sich ein Gewichts- und Datumsziel, um bei Ihrem Fortschritt motiviert zu bleiben
es_es: Establece una meta de peso y fecha para mantenerte motivado en tu progreso
fr_fr: Fixez un objectif de poids et une date pour rester motivé dans vos progrès
ja: 進捗のモチベーションを維持するために体重と日付の目標を設定してください
ko: 동기부여 목표 부제목
zh_hans: 设置体重和日期目标以保持进步动力
zh_hant: 設置目標以保持動力並追蹤進度

# create_goal_button
source: Create Goal
de_de: Ziel erstellen
es_es: Crear Objetivo
fr_fr: Créer un objectif
ja: 目標を作成
ko: 목표 생성 버튼
zh_hans: 创建目标
zh_hant: 創建目標

source: Current Goal
de_de: Aktuelles Ziel
es_es: Objetivo Actual
fr_fr: Objectif actuel
ja: 現在の目標
ko: 현재 목표
zh_hans: 当前目标
zh_hant: 當前目標

# realistic_goals_desc
source: Set achievable and healthy goals
de_de: Setzen Sie erreichbare und gesunde Ziele
es_es: Establece metas alcanzables y saludables
fr_fr: Fixez des objectifs atteignables et sains
ja: 達成可能で健康的な目標を設定してください
ko: 현실적인 목표 설명
zh_hans: 设置可实现和健康的目标
zh_hant: 設置現實且可達成的目標

# goal_motivation_text
source: Set a realistic and achievable goal to stay motivated
de_de: Setzen Sie sich ein realistisches und erreichbares Ziel, um motiviert zu bleiben
es_es: Establece un objetivo realista y alcanzable para mantenerte motivado
fr_fr: Fixez-vous un objectif réaliste et réalisable pour rester motivé
ja: モチベーションを維持するために現実的で達成可能な目標を設定しましょう
ko: 동기를 유지하기 위해 현실적이고 달성 가능한 목표를 설정하세요
zh_hans: 设定现实且可实现的目标以保持动力
zh_hant: 設定現實且可實現的目標以保持動力

source: Maximum Weight
de_de: Höchstgewicht
es_es: Peso Máximo
fr_fr: Poids Maximum
ja: 最大体重
ko: 최대 체중
zh_hans: 最大体重
zh_hant: 最大體重

source: Minimum Weight
de_de: Mindestgewicht
es_es: Peso Mínimo
fr_fr: Poids Minimum
ja: 最小体重
ko: 최소 체중
zh_hans: 最小体重
zh_hant: 最小體重

source: Target
de_de: Ziel
es_es: Objetivo
fr_fr: Cible
ja: 目標
ko: 목표
zh_hant: 目標

# kg_symbol
source: kg
ja: キロ
ko: 킬로
zh_hant: 公斤

# lb_symbol
source: lb
ja: ポンド
ko: 파운드
zh_hant: 磅

source: Error
de_de: Fehler
fr_fr: Erreur
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# weight_input.error_title
source: Error
de_de: Fehler
fr_fr: Erreur
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

# weight_input.error_ok
source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定

# weight_input.error_prefix
source: Error
de_de: Fehler:
fr_fr: Erreur
ja: エラー：
ko: 오류:
zh_hans: 错误：
zh_hant: 錯誤：

# weight_input.save_error_message
source: Could not save weight. Please try again.
ko: 체중을 저장할 수 없습니다. 다시 시도해 주세요.

source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定

# app_title
source: Weight Tracker
ja: 体重トラッカー
ko: 체중 추적기
zh_hans: 体重进度跟踪器
zh_hant: 體重追蹤器

# three_days_short
source: 3D
de_de: 3T
fr_fr: 3J
ja: 3日
ko: 3일
zh_hant: 3天

# seven_days_short
source: 7D
de_de: 7T
fr_fr: 7J
ja: 7日
ko: 7일
zh_hans: 7天
zh_hant: 7天

# fifteen_days_short
source: 15D
de_de: 15T
fr_fr: 15J
ja: 15日
ko: 15일
zh_hant: 15天

# thirty_days_short
source: 1M
ja: 1月
ko: 1개월
zh_hans: 1月
zh_hant: 1月

# three_months_short
source: 3M
ja: 3月
ko: 3개월
zh_hant: 3月

# six_months_short
source: 6M
ja: 6月
ko: 6개월
zh_hant: 6月

# ninety_days_short
source: 90D
de_de: 90T
fr_fr: 90J
ja: 90日
ko: 90일
zh_hans: 3月
zh_hant: 90天

source: Weight Progress Tracker
zh_hans: 体重进度跟踪器
