Repository: powfuu/weight-tracker
Catalog: Weight Progress Tracker/*.lproj/Localizable.strings
Languages: de_de, es_es, fr_fr, ja, ko, zh_hans, zh_hant

# weight_input.today_hint
source: Change the record date to today
de_de: Erfassungsdatum auf heute ändern
es_es: Cambiar la fecha de registro a hoy
fr_fr: Changer la date d'enregistrement à aujourd'hui
ja: 記録日を今日に変更
ko: 기록 날짜를 오늘로 변경
zh_hans: 将记录日期更改为今天
zh_hant: 將記錄日期更改為今天

# weight_input.select_date
source: Select date
de_de: Datum auswählen
es_es: Seleccionar fecha
fr_fr: Sélectionner la date
ja: 日付を選択
ko: 날짜 선택
zh_hans: 选择日期
zh_hant: 選擇日期

# weight_input.tips_title
source: Weight Loss Tracking Tips
de_de: Tipps für eine bessere Erfassung
es_es: Consejos de Seguimiento
fr_fr: Conseils pour un meilleur enregistrement
ja: より良い記録のためのヒント
ko: 더 나은 기록을 위한 팁
zh_hans: 更好记录的提示
zh_hant: 更好記錄的提示

# weight_input.tip_time
source: Always weigh yourself at the same time for accurate weight management
de_de: Wiegen Sie sich immer zur gleichen Tageszeit
es_es: Siempre pésate a la misma hora para mayor precisión
fr_fr: Pesez-vous toujours à la même heure de la journée
ja: 常に一日の同じ時間に体重を測定する
ko: 항상 하루 중 같은 시간에 체중을 측정하세요
zh_hans: 总是在一天中的同一时间称重
zh_hant: 總是在一天中的同一時間稱重

# weight_input.tip_fasting
source: Best results: weigh yourself fasting in the morning
de_de: Vorzugsweise morgens auf nüchternen Magen
es_es: Mejores resultados: pésate en ayunas por la mañana
fr_fr: De préférence le matin à jeun
ja: できれば朝の空腹時に
ko: 가급적 아침 공복 상태에서
zh_hans: 最好在早晨空腹时
zh_hant: 最好在早晨空腹時

# weight_input.tip_clothing
source: For precise tracking, use minimal clothing
de_de: Tragen Sie so wenig Kleidung wie möglich
es_es: Para mayor precisión, usa ropa mínima
fr_fr: Portez le moins de vêtements possible
ja: できるだけ少ない服装で
ko: 가능한 한 적은 옷을 입고
zh_hans: 尽可能少穿衣服
zh_hant: 儘可能少穿衣服

# weight_input.save_button
source: Save Weight
de_de: Gewicht speichern
es_es: Guardar Peso
fr_fr: Enregistrer le poids
ja: 体重を保存
ko: 체중 저장
zh_hans: 保存体重
zh_hant: 保存體重

# weight_input.saving
source: Saving...
de_de: Speichert...
es_es: Guardando...
fr_fr: Enregistrement...
ja: 保存中...
ko: 저장 중...
zh_hans: 保存中...
zh_hant: 保存中...

# weight_input.save_accessibility
source: Save weight
de_de: Gewicht speichern
es_es: Guardar peso
fr_fr: Enregistrer le poids
ja: 体重を保存
ko: 체중 저장
zh_hans: 保存体重
zh_hant: 保存體重

# weight_input.saving_accessibility
source: Saving weight
de_de: Gewicht wird gespeichert
es_es: Guardando peso
fr_fr: Enregistrement du poids
ja: 体重を保存中
ko: 체중 저장 중
zh_hans: 正在保存体重
zh_hant: 正在保存體重

# weight_input.save_hint
source: Save the entered weight to your record
de_de: Eingegebenes Gewicht in Ihrem Protokoll speichern
es_es: Guardar el peso ingresado en tu registro
fr_fr: Enregistrer le poids saisi dans votre tracker de poids
ja: 入力した体重を記録に保存
ko: 입력한 체중을 기록에 저장
zh_hans: 将输入的体重保存到您的记录中
zh_hant: 將輸入的體重保存到您的記錄中

# weight_input.success_title
source: Weight saved!
de_de: Gewicht gespeichert!
es_es: ¡Peso guardado!
fr_fr: Poids enregistré !
ja: 体重が保存されました！
ko: 체중이 저장되었습니다!
zh_hans: 体重已保存！
zh_hant: 體重已保存！

# weight_input.success_message
source: Your progress has been updated
de_de: Ihr Fortschritt wurde aktualisiert
es_es: Tu progreso ha sido actualizado
fr_fr: Vos progrès de contrôle du poids ont été mis à jour
ja: 進捗が更新されました
ko: 진행상황이 업데이트되었습니다
zh_hans: 您的进度已更新
zh_hant: 您的進度已更新

# main.no_records
source: No records
de_de: Keine Einträge
es_es: Sin registros
fr_fr: Aucun enregistrement
ja: 記録なし
ko: 기록 없음
zh_hans: 无记录
zh_hant: 無記錄

# main.register_new_weight
source: Log new weight
de_de: Neues Gewicht erfassen
es_es: Registrar nuevo peso
fr_fr: Enregistrer un nouveau poids
ja: 新しい体重を記録
ko: 새 체중 기록
zh_hans: 记录新体重
zh_hant: 記錄新體重

# main.register_first_weight
source: Log first weight
de_de: Erstes Gewicht erfassen
es_es: Registrar primer peso
fr_fr: Enregistrer le premier poids
ja: 初回体重を記録
ko: 첫 체중 기록
zh_hans: 记录首次体重
zh_hant: 記錄首次體重

# main.average
source: Average
de_de: Durchschnitt
es_es: Promedio
fr_fr: Moyenne
ja: 平均
ko: 평균
zh_hans: 平均
zh_hant: 平均

# main.minimum
source: Minimum
es_es: Mínimo
ja: 最小
ko: 최소
zh_hans: 最小
zh_hant: 最小

# main.maximum
source: Maximum
es_es: Máximo
ja: 最大
ko: 최대
zh_hans: 最大
zh_hant: 最大

# main.last_update
source: Last update
de_de: Letzte Aktualisierung
es_es: Última actualización
fr_fr: Dernière mise à jour
ja: 最終更新
ko: 마지막 업데이트
zh_hans: 最后更新
zh_hant: 最後更新

# main.day
source: day
de_de: Tag
es_es: día
fr_fr: jour
ja: 日
ko: 일
zh_hans: 天
zh_hant: 天

# main.change
source: Change
de_de: Änderung
es_es: Cambio
fr_fr: Changement
ja: 変化
ko: 변화
zh_hans: 变化
zh_hant: 變化

# main.actions
source: Actions
de_de: Aktionen
es_es: Acciones
ja: アクション
ko: 액션
zh_hans: 操作
zh_hant: 操作

# main.log_weight
source: Register Weight
de_de: Gewicht erfassen
es_es: Registrar Peso
fr_fr: Enregistrer le poids
ja: 体重を記録
ko: 체중 기록
zh_hans: 记录体重
zh_hant: 記錄體重

# main.view_statistics
source: Weight Loss Tracking Statistics
de_de: Statistiken anzeigen
es_es: Ver Estadísticas
fr_fr: Voir les statistiques de perte de poids
ja: 統計を表示
ko: 통계 보기
zh_hans: 查看统计
zh_hant: 查看統計

# main.goals
source: Weight Loss Goals
de_de: Ziele
es_es: Objetivos
fr_fr: Objectifs de poids
ja: ダイエット目標
ko: 목표
zh_hans: 减肥目标
zh_hant: 減肥目標

# main.settings
source: Weight Tracker Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
ja: 体重管理設定
ko: 설정
zh_hans: 体重管理设置
zh_hant: 體重管理設置

# main.weight_progress
source: Weight loss tracking progress
de_de: Gewichtstracker und Fortschritt
es_es: Tracker y Control de Peso Diario
fr_fr: Suivi du poids et progrès
ja: 体重トラッカーとダイエット進捗
ko: 체중 진행상황
zh_hans: 体重跟踪器和减肥进度
zh_hant: 體重追蹤器和減肥進度

# main.no_data
source: Not enough data
de_de: Unzureichende Daten
es_es: No hay datos suficientes
fr_fr: Données insuffisantes
ja: データが不十分
ko: 데이터 부족
zh_hans: 数据不足
zh_hant: 數據不足

# main.add_more_entries
source: Add more weight entries to see your weight loss progress
de_de: Fügen Sie weitere Gewichtseinträge hinzu, um den Gewichtsverlust-Fortschritt zu sehen
es_es: Agrega más registros de peso para ver tu seguimiento y control completo
fr_fr: Ajoutez plus d'enregistrements dans votre tracker de poids pour voir les progrès
ja: ダイエット進捗を確認するためにより多くの体重記録を追加してください
ko: 진행상황을 확인하기 위해 더 많은 체중 기록을 추가하세요
zh_hans: 添加更多体重记录以查看您的减肥进度
zh_hant: 添加更多體重記錄以查看您的減肥進度

# main.weight_down
source: You lost weight
de_de: Sie haben abgenommen
es_es: Bajaste
fr_fr: Vous avez perdu du poids
ja: ダイエット進捗：体重が減りました
ko: 체중이 감소했습니다
zh_hans: 您的减肥进度：减重了
zh_hant: 您的減肥進度：減重了

# main.weight_up
source: You gained weight
de_de: Sie haben zugenommen
es_es: Subiste
fr_fr: Vous avez pris du poids
ja: 体重トラッカー表示：体重が増えました
ko: 체중이 증가했습니다
zh_hans: 您的体重跟踪器显示：增重了
zh_hant: 您的體重追蹤器顯示：增重了

# main.weight_stable_week
source: Stable weight this week
de_de: Gewicht diese Woche stabil
es_es: Peso estable esta semana
fr_fr: Poids stable cette semaine
ja: 今週は体重が安定
ko: 이번 주 체중이 안정적
zh_hans: 本周体重稳定
zh_hant: 本週體重穩定

# main.weight_stable_month
source: Stable weight this month
de_de: Gewicht diesen Monat stabil
es_es: Peso estable este mes
fr_fr: Poids stable ce mois
ja: 今月は体重が安定
ko: 이번 달 체중이 안정적
zh_hans: 本月体重稳定
zh_hant: 本月體重穩定

# main.weight_stable_90days
source: Stable weight in 90 days
de_de: Gewicht 90 Tage stabil
es_es: Peso estable en 90 días
fr_fr: Poids stable depuis 90 jours
ja: 90日間体重が安定
ko: 90일간 체중이 안정적
zh_hans: 90天内体重稳定
zh_hant: 90天內體重穩定

# main.weight_stable_year
source: Stable weight this year
de_de: Gewicht dieses Jahr stabil
es_es: Peso estable este año
fr_fr: Poids stable cette année
ja: 今年は体重が安定
ko: 올해 체중이 안정적
zh_hans: 今年体重稳定
zh_hant: 今年體重穩定

# main.records_performed
source: records performed
de_de: Einträge durchgeführt
es_es: pesajes realizados
fr_fr: enregistrements effectués
ja: 回の記録
ko: 회 기록
zh_hans: 次记录
zh_hant: 次記錄

# main.consecutive_days
source: consecutive days
de_de: Aufeinanderfolgende Tage
es_es: días consecutivos
fr_fr: Jours consécutifs
ja: 連続日数
ko: 연속 일수
zh_hans: 连续天数
zh_hant: 連續天數

# main.days_tracking
source: days tracking
de_de: Tage der Gewichtskontrolle
es_es: días registrando
fr_fr: Jours de suivi du poids
ja: 追跡日数
ko: 추적 일수
zh_hans: 跟踪天数
zh_hant: 跟蹤天數

# main.keep_logging
source: Keep logging your weight in the tracker
de_de: Führen Sie weiterhin Ihr Gewicht im Tracker auf
es_es: Sigue registrando tu peso en el tracker
fr_fr: Continuez le contrôle de votre poids
ja: 体重トラッカーでの記録を続けてください
ko: 체중 기록을 계속하세요
zh_hans: 继续记录您的体重
zh_hant: 繼續記錄您的體重

# main.every_step_counts
source: Every step counts in weight loss!
de_de: Jeder Schritt zählt!
es_es: ¡Cada paso cuenta en tu pérdida de peso!
fr_fr: Chaque étape de perte de poids compte !
ja: 一歩一歩が大切です！
ko: 모든 단계가 중요합니다!
zh_hans: 每一步都很重要！
zh_hant: 每一步都很重要！

# main.keep_consistency
source: Keep consistency in weight management
de_de: Bleiben Sie konsequent
es_es: Mantén la constancia en tu control de peso
fr_fr: Maintenez la cohérence dans votre suivi
ja: 一貫性を保ってください
ko: 일관성을 유지하세요
zh_hans: 保持一致性
zh_hant: 保持一致性

# main.keep_it_up
source: Keep it up with your tracking!
de_de: Weiter so!
es_es: ¡Sigue así con tu seguimiento!
fr_fr: Continuez votre tracker de poids !
ja: その調子です！
ko: 계속 잘하고 있어요!
zh_hans: 继续保持！
zh_hant: 繼續保持！

# main.goal
source: Weight Loss Goal
de_de: Ziel
es_es: Objetivo de Peso
fr_fr: Objectif de poids
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

# main.stay_consistent
source: Stay consistent with your tracker
de_de: Bleiben Sie konsequent
es_es: Mantén la constancia en tu tracker
fr_fr: Restez constant dans votre suivi
ja: 一貫性を保つ
ko: 일관성을 유지하세요
zh_hans: 保持一致
zh_hant: 保持一致

# define_goal
source: Define your goal!
de_de: Definiere dein Ziel!
es_es: ¡Define tu objetivo!
fr_fr: Définissez votre objectif !
ja: 目標を設定しましょう！
ko: 목표를 설정하세요!
zh_hans: 定义你的目标！
zh_hant: 定義你的目標！

# days_remaining
source: days
de_de: Tage
es_es: días
fr_fr: jours
ja: 日
ko: 일
zh_hans: 天
zh_hant: 天

# log_more_weights
source: Log more weights to see your progress
de_de: Trage mehr Gewichte ein, um deinen Fortschritt zu sehen
es_es: Registra más pesos para ver tu progreso
fr_fr: Enregistrez plus de poids pour voir vos progrès
ja: 進捗を確認するためにもっと体重を記録してください
ko: 진행 상황을 보려면 더 많은 체중을 기록하세요
zh_hans: 记录更多体重以查看进度
zh_hant: 記錄更多體重以查看進度

source: Achievement Unlocked!
de_de: Erfolg Freigeschaltet!
es_es: ¡Logro Desbloqueado!
fr_fr: Succès débloqué !
ja: 実績解除！
ko: 성취 달성!
zh_hans: 成就解锁！
zh_hant: 成就解鎖！

source: Great!
de_de: Großartig!
es_es: ¡Genial!
fr_fr: Génial !
ja: 素晴らしい！
ko: 훌륭해요!
zh_hans: 太棒了！
zh_hant: 太棒了！

# welcome_companion
source: Your ultimate weight loss app companion
de_de: Dein Gewichtstracker-Begleiter
es_es: Tu tracker de peso personal y privado para pérdida de peso
fr_fr: Votre compagnon de suivi de poids
ja: あなたの体重追跡パートナー
ko: 당신의 체중 추적 동반자
zh_hans: 你的体重跟踪器和减肥管理伙伴
zh_hant: 你的體重追蹤器和減肥管理夥伴

# welcome_to_app
source: Welcome to Weight Progress - Body Weight Log!
de_de: Willkommen bei Ihrem Gewichtsverlust-Tracker!
es_es: ¡Bienvenido a tu Tracker y Control de Peso Diario!
fr_fr: Bienvenue dans Weight Progress !
ja: Weight Progressへようこそ！
ko: Weight Progress에 오신 것을 환영합니다!
zh_hans: 欢迎使用体重跟踪器应用！
zh_hant: 歡迎使用體重追蹤器應用！

source: Last record
de_de: Letzter Eintrag
es_es: Último registro
fr_fr: Dernier enregistrement
ja: 最後の記録
ko: 마지막 기록
zh_hans: 最后记录
zh_hant: 最後記錄

# enter_valid_weight
source: Enter a valid weight
de_de: Gib ein gültiges Gewicht ein
es_es: Ingresa un peso válido
fr_fr: Entrez un poids valide
ja: 有効な体重を入力してください
ko: 유효한 체중을 입력하세요
zh_hans: 输入有效体重
zh_hant: 輸入有效體重

source: Duration
de_de: Dauer
es_es: Duración
fr_fr: Durée
ja: 期間
ko: 기간
zh_hans: 持续时间
zh_hant: 持續時間

# delete_goal_confirm
source: Are you sure you want to delete this goal? This action cannot be undone.
de_de: Bist du sicher, dass du dieses Ziel löschen möchtest? Diese Aktion kann nicht rückgängig gemacht werden.
es_es: ¿Estás seguro de que quieres eliminar este objetivo? Esta acción no se puede deshacer.
fr_fr: Êtes-vous sûr de vouloir supprimer cet objectif ? Cette action ne peut pas être annulée.
ja: この目標を削除してもよろしいですか？この操作は元に戻せません。
ko: 이 목표를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh_hans: 你确定要删除这个目标吗？此操作无法撤销。
zh_hant: 你確定要刪除這個目標嗎？此操作無法撤銷。

# adjust_goal
source: Adjust your goal according to your current progress
de_de: Passe dein Ziel entsprechend deinem aktuellen Fortschritt an
es_es: Ajusta tu objetivo según tu progreso actual
fr_fr: Ajustez votre objectif selon vos progrès actuels
ja: 現在の進捗に応じて目標を調整してください
ko: 현재 진행 상황에 따라 목표를 조정하세요
zh_hans: 根据当前进度调整目标
zh_hant: 根據當前進度調整目標

# goal_stats
source: Goal statistics
de_de: Zielstatistiken
es_es: Estadísticas del objetivo
fr_fr: Statistiques de l'objectif
ja: 目標統計
ko: 목표 통계
zh_hans: 目标统计
zh_hant: 目標統計

# goal_action
source: This will
de_de: Das wird
es_es: Esto va a
fr_fr: Cela va
ja: これは
ko: 이것은
zh_hans: 这将
zh_hant: 這將

source: increase
de_de: erhöhen
es_es: aumentar
fr_fr: augmenter
ja: 増加
ko: 증가
zh_hans: 增加
zh_hant: 增加

source: decrease
de_de: verringern
es_es: reducir
fr_fr: diminuer
ja: 減少
ko: 감소
zh_hans: 减少
zh_hant: 減少

source: extend
de_de: verlängern
es_es: extender
fr_fr: prolonger
ja: 延長
ko: 연장
zh_hans: 延长
zh_hant: 延長

source: shorten
de_de: verkürzen
es_es: acortar
fr_fr: raccourcir
ja: 短縮
ko: 단축
zh_hans: 缩短
zh_hant: 縮短

source: Progress Chart
de_de: Fortschrittsdiagramm
es_es: Gráfico de Progreso
fr_fr: Graphique de progression
ja: 進捗チャート
ko: 진행 차트
zh_hans: 进度图表
zh_hant: 進度圖表

# detailed_stats
source: Detailed Statistics
de_de: Detaillierte Statistiken
es_es: Estadísticas Detalladas
fr_fr: Statistiques détaillées
ja: 詳細統計
ko: 상세 통계
zh_hans: 详细统计
zh_hant: 詳細統計

source: Achievements
de_de: Erfolge
es_es: Logros
fr_fr: Réussites
ja: 実績
ko: 성취
zh_hans: 成就
zh_hant: 成就

# achievements_and_stats
source: Achievements & Stats
de_de: Erfolge & Statistiken
es_es: Logros y Estadísticas
fr_fr: Réussites & Statistiques
ja: 実績 & 統計
ko: 성취 & 통계
zh_hans: 成就 & 统计
zh_hant: 成就 & 統計

source: Statistics
de_de: Statistiken
es_es: Estadísticas
fr_fr: Statistiques
ja: 統計
ko: 통계
zh_hans: 统计
zh_hant: 統計

# start_journey
source: Start Your Journey
de_de: Beginnen Sie Ihre Reise
es_es: Comienza tu Viaje
fr_fr: Commencez votre parcours
ja: 旅を始めましょう
ko: 여정 시작하기
zh_hans: 开始您的旅程
zh_hant: 開始您的旅程

# start_journey_desc
source: Begin tracking your weight to unlock achievements and see your progress
de_de: Beginnen Sie mit der Gewichtsverfolgung, um Erfolge freizuschalten und Ihren Fortschritt zu sehen
es_es: Comienza a registrar tu peso para desbloquear logros y ver tu progreso
fr_fr: Commencez à suivre votre poids pour débloquer des réussites et voir vos progrès
ja: 体重追跡を開始して実績をアンロックし、進捗を確認しましょう
ko: 체중 추적을 시작하여 성취를 해제하고 진행상황을 확인하세요
zh_hans: 开始追踪您的体重以解锁成就并查看您的进度
zh_hant: 開始追蹤您的體重以解鎖成就並查看您的進度

source: Current Streak
de_de: Aktuelle Serie
es_es: Racha Actual
fr_fr: Série actuelle
ja: 現在の連続記録
ko: 현재 연속 기록
zh_hans: 当前连续记录
zh_hant: 當前連續記錄

source: consecutive days
de_de: aufeinanderfolgende Tage
es_es: días consecutivos
fr_fr: jours consécutifs
ja: 連続日数
ko: 연속 일수
zh_hans: 连续天数
zh_hant: 連續天數

# achievement_first_entry
source: First Step
de_de: Erster Schritt
es_es: Primer Paso
fr_fr: Premier Pas
ja: 第一歩
ko: 첫 걸음
zh_hans: 第一步
zh_hant: 第一步

# achievement_week_streak
source: Week Complete
de_de: Vollständige Woche
es_es: Semana Completa
fr_fr: Semaine Complète
ja: 1週間継続
ko: 일주일 연속
zh_hans: 完整一周
zh_hant: 完整一週

# achievement_month_streak
source: Month Consistent
de_de: Beständiger Monat
es_es: Mes Consistente
fr_fr: Mois Cohérent
ja: 1ヶ月継続
ko: 한 달 연속
zh_hans: 坚持一月
zh_hant: 堅持一月

# achievement_weight_loss_5kg
source: 5kg Less
de_de: 5kg weniger
es_es: 5kg Menos
fr_fr: 5kg en Moins
ja: 5キロ減量
ko: 5킬로 감량
zh_hans: 减重5公斤
zh_hant: 減重5公斤

# achievement_weight_loss_10kg
source: 10kg Less
de_de: 10kg weniger
es_es: 10kg Menos
fr_fr: 10kg en Moins
ja: 10キロ減量
ko: 10킬로 감량
zh_hans: 减重10公斤
zh_hant: 減重10公斤

# achievement_consistent_logger
source: Consistent Logger
de_de: Beständiger Tracker
es_es: Registrador Constante
fr_fr: Enregistreur Cohérent
ja: 継続記録者
ko: 꾸준한 기록자
zh_hans: 坚持记录者
zh_hant: 堅持記錄者

# achievement_goal_achiever
source: Goal Achiever
de_de: Zielverfolger
es_es: Alcanzador de Metas
fr_fr: Atteigneur d'Objectifs
ja: 目標達成者
ko: 목표 달성자
zh_hans: 目标达成者
zh_hant: 目標達成者

# achievement_data_explorer
source: Data Explorer
de_de: Datenentdecker
es_es: Explorador de Datos
fr_fr: Explorateur de Données
ja: データ探索者
ko: 데이터 탐험가
zh_hans: 数据探索者
zh_hant: 數據探索者

# achievement_first_entry_desc
source: You logged your first weight
de_de: Sie haben Ihr erstes Gewicht erfasst
es_es: Registraste tu primer peso
fr_fr: Vous avez enregistré votre premier poids
ja: 初回の体重を記録しました
ko: 첫 번째 체중을 기록했습니다
zh_hans: 您已记录了第一次体重
zh_hant: 您已記錄了第一次體重

# achievement_week_streak_desc
source: 7 consecutive days logging weight
de_de: 7 aufeinanderfolgende Tage Gewichtserfassung
es_es: 7 días consecutivos registrando peso
fr_fr: 7 jours consécutifs d'enregistrement de poids
ja: 7日間連続で体重を記録
ko: 7일 연속 체중 기록
zh_hans: 连续7天记录体重
zh_hant: 連續7天記錄體重

# achievement_month_streak_desc
source: 30 consecutive days logging weight
de_de: 30 aufeinanderfolgende Tage Gewichtserfassung
es_es: 30 días consecutivos registrando peso
fr_fr: 30 jours consécutifs d'enregistrement de poids
ja: 30日間連続で体重を記録
ko: 30일 연속 체중 기록
zh_hans: 连续30天记录体重
zh_hant: 連續30天記錄體重

# achievement_weight_loss_5kg_desc
source: You lost 5kg since your first record
de_de: Sie haben 5kg seit Ihrer ersten Erfassung verloren
es_es: Perdiste 5kg desde tu primer registro
fr_fr: Vous avez perdu 5kg depuis votre premier enregistrement
ja: 初回記録から5キロ減量しました
ko: 첫 기록 이후 5킬로 감량했습니다
zh_hans: 自首次记录以来您已减重5公斤
zh_hant: 自首次記錄以來您已減重5公斤

# achievement_weight_loss_10kg_desc
source: You lost 10kg since your first record
de_de: Sie haben 10kg seit Ihrer ersten Erfassung verloren
es_es: Perdiste 10kg desde tu primer registro
fr_fr: Vous avez perdu 10kg depuis votre premier enregistrement
ja: 初回記録から10キロ減量しました
ko: 첫 기록 이후 10킬로 감량했습니다
zh_hans: 自首次记录以来您已减重10公斤
zh_hant: 自首次記錄以來您已減重10公斤

# achievement_consistent_logger_desc
source: 50 weight records completed
de_de: 50 Gewichtserfassungen abgeschlossen
es_es: 50 registros de peso completados
fr_fr: 50 enregistrements de poids complétés
ja: 50回の体重記録を完了
ko: 50회 체중 기록 완료
zh_hans: 完成50次体重记录
zh_hant: 完成50次體重記錄

# achievement_goal_achiever_desc
source: You reached your weight goal
de_de: Sie haben Ihr Gewichtsziel erreicht
es_es: Alcanzaste tu meta de peso
fr_fr: Vous avez atteint votre objectif de poids
ja: 体重目標を達成しました
ko: 체중 목표를 달성했습니다
zh_hans: 您已达到体重目标
zh_hant: 您已達到體重目標

# achievement_data_explorer_desc
source: You explored all chart views
de_de: Sie haben alle Diagrammansichten erkundet
es_es: Exploraste todas las vistas de gráficos
fr_fr: Vous avez exploré toutes les vues de graphiques
ja: すべてのチャートビューを探索しました
ko: 모든 차트 뷰를 탐색했습니다
zh_hans: 您已探索了所有图表视图
zh_hant: 您已探索了所有圖表視圖

# streak_start_today
source: Start your streak today!
de_de: Beginnen Sie heute Ihre Serie!
es_es: ¡Comienza tu racha hoy!
fr_fr: Commencez votre série aujourd'hui !
ja: 今日から記録を始めましょう！
ko: 오늘부터 기록을 시작하세요!
zh_hans: 今天开始您的连续记录！
zh_hant: 今天開始您的連續記錄！

# streak_good_way
source: You're on the right track! Day %d
de_de: Sie sind auf dem richtigen Weg! Tag %d
es_es: ¡Vas por buen camino! Día %d
fr_fr: Vous êtes sur la bonne voie ! Jour %d
ja: 順調です！%d日目
ko: 잘하고 있어요! %d일째
zh_hans: 您走在正确的道路上！第%d天
zh_hant: 您走在正確的道路上！第%d天

# streak_incredible
source: Incredible! %d consecutive days
de_de: Unglaublich! %d aufeinanderfolgende Tage
es_es: ¡Increíble! %d días consecutivos
fr_fr: Incroyable ! %d jours consécutifs
ja: 素晴らしい！%d日連続
ko: 놀라워요! %d일 연속
zh_hans: 太棒了！连续%d天
zh_hant: 太棒了！連續%d天

# streak_unstoppable
source: You're unstoppable! %d days
de_de: Sie sind unaufhaltsam! %d Tage
es_es: ¡Eres imparable! %d días
fr_fr: Vous êtes inarrêtable ! %d jours
ja: 止まらない！%d日
ko: 멈출 수 없어요! %d일
zh_hans: 您势不可挡！%d天
zh_hant: 您勢不可擋！%d天

# current_streak_title
source: Current Streak
de_de: Aktuelle Serie
es_es: Racha Actual
fr_fr: Série Actuelle
ja: 現在の連続記録
ko: 현재 연속 기록
zh_hans: 当前连续记录
zh_hant: 當前連續記錄

# consecutive_days_subtitle
source: consecutive days
de_de: aufeinanderfolgende Tage
es_es: días consecutivos
fr_fr: jours consécutifs
ja: 連続日数
ko: 연속 일수
zh_hans: 连续天数
zh_hant: 連續天數

# best_streak_title
source: Best Streak
de_de: Beste Serie
es_es: Mejor Racha
fr_fr: Meilleure Série
ja: 最高記録
ko: 최고 기록
zh_hans: 最佳连续记录
zh_hant: 最佳連續記錄

# max_days_subtitle
source: maximum days
de_de: maximale Tage
es_es: días máximos
fr_fr: jours maximum
ja: 最大日数
ko: 최대 일수
zh_hans: 最多天数
zh_hant: 最多天數

# achievements_title
source: Achievements
de_de: Erfolge
es_es: Logros
fr_fr: Réussites
ja: 実績
ko: 성취
zh_hans: 成就
zh_hant: 成就

# achievements_of_total
source: of %d
de_de: von %d
es_es: de %d
fr_fr: sur %d
ja: %d個中
ko: 총 %d개 중
zh_hans: 共%d个
zh_hant: 共%d個

source: Motivational Stats
de_de: Motivationsstatistiken
es_es: Estadísticas Motivacionales
fr_fr: Statistiques motivationnelles
ja: モチベーション統計
ko: 동기부여 통계
zh_hans: 激励统计
zh_hant: 激勵統計

source: Overall Progress
de_de: Gesamtfortschritt
es_es: Progreso General
fr_fr: Progrès global
ja: 全体の進捗
ko: 전체 진행상황
zh_hans: 整体进度
zh_hant: 整體進度

source: Unlocked
de_de: Freigeschaltet
es_es: Desbloqueado
fr_fr: Débloqué
ja: アンロック済み
ko: 해제됨
zh_hans: 已解锁
zh_hant: 已解鎖

source: Unlocked Achievements
de_de: Freigeschaltete Erfolge
es_es: Logros Desbloqueados
fr_fr: Réussites débloquées
ja: アンロック済み実績
ko: 해제된 성취
zh_hans: 已解锁成就
zh_hant: 已解鎖成就

source: Best
de_de: Beste
es_es: Mejor
fr_fr: Meilleur
ja: 最高
ko: 최고
zh_hans: 最佳
zh_hant: 最佳

source: completed
de_de: Abgeschlossen
es_es: completado
fr_fr: terminé
ja: 完了
ko: 완료됨
zh_hans: 已完成
zh_hant: 已完成

source: Today completed
de_de: Heute abgeschlossen
es_es: Hoy completado
fr_fr: Terminé aujourd'hui
ja: 今日完了
ko: 오늘 완료
zh_hans: 今天已完成
zh_hant: 今天已完成

source: Log today
de_de: Heute erfassen
es_es: Registrar hoy
fr_fr: Enregistrer aujourd'hui
ja: 今日記録
ko: 오늘 기록
zh_hans: 今天记录
zh_hant: 今天記錄

# notification_daily_reminder
source: Receive daily reminders to maintain your progress
de_de: Erhalten Sie tägliche Erinnerungen, um Ihren Fortschritt aufrechtzuerhalten
es_es: Recibe recordatorios diarios para mantener tu progreso
fr_fr: Recevez des rappels quotidiens pour maintenir vos progrès
ja: 進捗を維持するために毎日のリマインダーを受け取る
ko: 진행 상황을 유지하기 위해 매일 알림을 받으세요
zh_hans: 接收每日提醒以保持您的进度
zh_hant: 接收每日提醒以保持您的進度

# notification_important_info
source: Important Information
de_de: Wichtige Informationen
es_es: Información importante
fr_fr: Informations importantes
ja: 重要な情報
ko: 중요한 정보
zh_hans: 重要信息
zh_hant: 重要資訊

# notification_habit_help
source: Notifications will help you maintain the habit of recording your weight daily.
de_de: Benachrichtigungen helfen Ihnen dabei, die Gewohnheit beizubehalten, Ihr Gewicht täglich zu erfassen.
es_es: Las notificaciones te ayudarán a mantener el hábito de registro diario.
fr_fr: Les notifications vous aideront à maintenir l'habitude d'enregistrer votre poids quotidiennement.
ja: 通知は毎日体重を記録する習慣を維持するのに役立ちます。
ko: 알림은 매일 체중을 기록하는 습관을 유지하는 데 도움이 됩니다.
zh_hans: 通知将帮助您保持每日记录体重的习惯。
zh_hant: 通知將幫助您保持每日記錄體重的習慣。

# notification_permission_title
source: Notification Permission
de_de: Benachrichtigungsberechtigung
es_es: Permiso de Notificaciones
fr_fr: Permission de Notification
ja: 通知許可
ko: 알림 권한
zh_hans: 通知权限
zh_hant: 通知權限

# notification_permission_message
source: Please enable notifications in Settings to receive daily weight reminders.
de_de: Bitte erlauben Sie Benachrichtigungen, um Erinnerungen zu erhalten
es_es: Por favor habilita las notificaciones en Configuración para recibir recordatorios diarios de peso.
fr_fr: Pour recevoir des rappels quotidiens, veuillez autoriser les notifications dans les paramètres.
ja: リマインダーを受け取るために通知を許可してください
ko: 매일 체중 알림을 받으려면 설정에서 알림을 활성화해 주세요.
zh_hans: 请在设置中启用通知以接收体重记录提醒。
zh_hant: 請在設定中啟用通知以接收體重記錄提醒。

# configuration
source: Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Configuration
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

source: Units
de_de: Einheiten
es_es: Unidades
fr_fr: Unités
ja: 単位
ko: 단위
zh_hans: 单位
zh_hant: 單位

source: Weight unit
de_de: Gewichtseinheit
es_es: Unidad de peso
fr_fr: Unité de poids
ja: 体重の単位
ko: 체중 단위
zh_hans: 体重单位
zh_hant: 體重單位
