Repository: powfuu/weight-tracker
Catalog: Weight Progress Tracker/*.lproj/Localizable.strings
Languages: de_de, es_es, fr_fr, ja, ko, zh_hans, zh_hant

# streak_60_days_desc
source: Two months of commitment! Your discipline is inspiring.
de_de: Zwei Monate Engagement! Ihre Disziplin ist inspirierend.
es_es: ¡Dos meses de compromiso! Tu disciplina es inspiradora.
fr_fr: Deux mois d'engagement ! Votre discipline est inspirante.
ja: 2ヶ月間のコミット！あなたの規律は感動的です。
ko: 2개월간의 헌신! 당신의 규율은 영감을 줍니다.
zh_hans: 两个月的坚持！您的纪律令人鼓舞。
zh_hant: 連續兩個月記錄體重！

# streak_90_days
source: 90-Day Streak!
de_de: 90-Tage-Serie!
es_es: ¡Racha de 90 Días!
fr_fr: Série de 90 jours !
ja: 90日連続！
ko: 90일 연속!
zh_hans: 90天连续记录！
zh_hant: 90天連續記錄

# streak_90_days_desc
source: Three months of excellence! You've mastered the habit.
de_de: Drei Monate Exzellenz! Sie haben die Gewohnheit gemeistert.
es_es: ¡Tres meses de excelencia! Has dominado el hábito.
fr_fr: Trois mois d'excellence ! Vous avez maîtrisé l'habitude.
ja: 3ヶ月間の優秀さ！習慣をマスターしました。
ko: 3개월간의 우수함! 습관을 마스터했습니다.
zh_hans: 三个月的卓越！您已经掌握了这个习惯。
zh_hant: 連續三個月記錄體重！

source: Keep Going!
de_de: Weiter so!
es_es: ¡Sigue Adelante!
fr_fr: Continuez !
ja: 続けてください！
ko: 계속하세요!
zh_hans: 继续前进！
zh_hant: 繼續努力！

# keep_going_desc
source: Don't break your streak! Log your weight today.
de_de: Brechen Sie Ihre Serie nicht! Erfassen Sie heute Ihr Gewicht.
es_es: ¡No rompas tu racha! Registra tu peso hoy.
fr_fr: Ne cassez pas votre série ! Enregistrez votre poids aujourd'hui.
ja: 連続記録を破らないで！今日体重を記録してください。
ko: 연속 기록을 깨지 마세요! 오늘 체중을 기록하세요.
zh_hans: 不要打破您的连续记录！今天记录您的体重。
zh_hant: 您正在朝著目標前進！

# weekly_progress_title
source: Weekly Progress Update
de_de: Wöchentliches Fortschritts-Update
es_es: Actualización de Progreso Semanal
fr_fr: Mise à jour des progrès hebdomadaires
ja: 週間進捗更新
ko: 주간 진행 업데이트
zh_hans: 每周进度更新
zh_hant: 每週進度

source: Time to Weigh In!
de_de: Zeit zum Wiegen!
es_es: ¡Hora de Pesarte!
fr_fr: Heure de se Peser !
ja: 体重測定の時間！
ko: 체중 측정 시간!
zh_hans: 称重时间！
zh_hant: 稱重時間！

# time_to_weigh_in_desc
source: Don't forget to log your weight today for accurate tracking.
de_de: Vergessen Sie nicht, Ihr Gewicht heute für eine genaue Verfolgung zu protokollieren.
es_es: No olvides registrar tu peso hoy para continuar tu seguimiento.
fr_fr: N'oubliez pas d'enregistrer votre poids aujourd'hui pour un suivi précis.
ja: 正確な追跡のために、今日の体重を記録することを忘れないでください。
ko: 정확한 추적을 위해 오늘의 체중을 기록하는 것을 잊지 마세요.
zh_hans: 不要忘记记录今天的体重以进行准确的追踪。
zh_hant: 不要忘記記錄今天的體重以進行準確的追蹤。

# weekly_progress_desc
source: Check out your progress this week and see how you're doing with your goals.
de_de: Schauen Sie sich Ihren Fortschritt diese Woche an und sehen Sie, wie Sie mit Ihren Zielen vorankommen.
es_es: Revisa tu progreso semanal y ve cómo vas con tus objetivos.
fr_fr: Découvrez vos progrès cette semaine et voyez comment vous vous en sortez avec vos objectifs.
ja: 今週の進捗をチェックして、目標に対してどのように進んでいるかを確認してください。
ko: 이번 주 진행 상황을 확인하고 목표에 대해 어떻게 진행되고 있는지 확인하세요.
zh_hans: 查看本周的进度，看看您在目标方面的进展如何。
zh_hant: 查看您本週的體重變化

source: Log Weight
de_de: Gewicht protokollieren
es_es: Registrar Peso
fr_fr: Enregistrer le Poids
ja: 体重を記録
ko: 체중 기록
zh_hans: 记录体重
zh_hant: 記錄體重

source: Remind in 1 Hour
de_de: In 1 Stunde erinnern
es_es: Recordar en 1 Hora
fr_fr: Rappeler dans 1 Heure
ja: 1時間後にリマインド
ko: 1시간 후 알림
zh_hans: 1小时后提醒
zh_hant: 1小時後提醒

source: View Progress
de_de: Fortschritt anzeigen
es_es: Ver Progreso
fr_fr: Voir les Progrès
ja: 進捗を表示
ko: 진행 상황 보기
zh_hans: 查看进度
zh_hant: 查看進度

source: View Stats
de_de: Statistiken anzeigen
es_es: Ver Estadísticas
fr_fr: Voir les Statistiques
ja: 統計を表示
ko: 통계 보기
zh_hans: 查看统计
zh_hant: 查看統計

source: View Charts
de_de: Diagramme anzeigen
es_es: Ver Gráficos
fr_fr: Voir les Graphiques
ja: チャートを表示
ko: 차트 보기
zh_hans: 查看图表
zh_hant: 查看圖表

source: Weight Reminder
de_de: Gewichts-Erinnerung
es_es: Recordatorio
fr_fr: Rappel de Poids
ja: 体重リマインダー
ko: 체중 알림
zh_hans: 体重提醒
zh_hant: 體重提醒

# weight_reminder_desc
source: It's time to log your weight and monitor your progress!
de_de: Es ist Zeit, Ihr Gewicht zu protokollieren und Ihren Fortschritt zu überwachen!
es_es: ¡Es hora de registrar tu peso!
fr_fr: Il est temps d'enregistrer votre poids et de surveiller vos progrès !
ja: 体重を記録して進捗を監視する時間です！
ko: 체중을 기록하고 진행 상황을 모니터링할 시간입니다!
zh_hans: 是时候记录您的体重并监控进度了！
zh_hant: 記得記錄您今天的體重

source: Close
de_de: Schließen
es_es: Cerrar
fr_fr: Fermer
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

# privacy_important
source: Your privacy is important
de_de: Ihre Privatsphäre ist wichtig
es_es: Tu privacidad es importante
fr_fr: Votre vie privée est importante
ja: あなたのプライバシーは重要です
ko: 귀하의 개인정보는 중요합니다
zh_hans: 您的隐私很重要
zh_hant: 隱私很重要

source: Data Collection
de_de: Datensammlung
es_es: Recolección de Datos
fr_fr: Collecte de données
ja: データ収集
ko: 데이터 수집
zh_hans: 数据收集
zh_hant: 數據收集

# data_collection_desc
source: Weight Progress Tracker only collects the weight data you manually enter. We do not collect personal information, location data, or any other sensitive information. All data remains on your device.
de_de: Weight Progress Tracker sammelt nur die Gewichtsdaten, die Sie manuell eingeben. Wir sammeln keine persönlichen Informationen, Standortdaten oder andere sensible Informationen. Alle Daten bleiben auf Ihrem Gerät.
es_es: Weight Progress Tracker solo recolecta los datos de peso que ingresas manualmente. No recolectamos información personal, datos de ubicación, o cualquier otra información sensible. Todos los datos permanecen en tu dispositivo.
fr_fr: Weight Progress Tracker ne collecte que les données de poids que vous saisissez manuellement. Nous ne collectons pas d'informations personnelles, de données de localisation ou toute autre information sensible. Toutes les données restent sur votre appareil.
ja: Weight Progress Trackerは、あなたが手動で入力した体重データのみを収集します。個人情報、位置データ、その他の機密情報は収集しません。すべてのデータはあなたのデバイスに残ります。
ko: Weight Progress Tracker는 귀하가 수동으로 입력한 체중 데이터만 수집합니다. 개인 정보, 위치 데이터 또는 기타 민감한 정보는 수집하지 않습니다. 모든 데이터는 귀하의 기기에 남아 있습니다.
zh_hans: Weight Progress Tracker只收集您手动输入的体重数据。我们不收集个人信息、位置数据或任何其他敏感信息。所有数据都保留在您的设备上。
zh_hant: Weight Progress Tracker在您的設備上本地存儲您的體重數據。我們不收集、傳輸或存儲您在我們服務器上的個人信息。

# last_updated
source: Last updated: August 2025
de_de: Zuletzt aktualisiert: August 2025
es_es: Última actualización: Agosto 2025
fr_fr: Dernière mise à jour : Août 2025
ja: 最終更新：2025年8月
ko: 마지막 업데이트: 2025년 8월
zh_hans: 最后更新：2025年8月
zh_hant: 最後更新：2025年8月

source: Data Usage
de_de: Datenverwendung
es_es: Uso de Datos
fr_fr: Utilisation des données
ja: データ使用
ko: 데이터 사용
zh_hans: 数据使用
zh_hant: 數據使用

# data_usage_desc
source: Your weight data is used exclusively to display your progress, calculate statistics, and provide insights about your weight journey. We do not share this data with third parties.
de_de: Ihre Gewichtsdaten werden ausschließlich verwendet, um Ihren Fortschritt anzuzeigen, Statistiken zu berechnen und Einblicke in Ihre Gewichtsreise zu geben. Wir teilen diese Daten nicht mit Dritten.
es_es: Tus datos de peso se usan exclusivamente para mostrar tu progreso, calcular estadísticas, y proporcionar información sobre tu viaje de peso. No compartimos estos datos con terceros.
fr_fr: Vos données de poids sont utilisées exclusivement pour afficher vos progrès, calculer des statistiques et fournir des informations sur votre parcours de poids. Nous ne partageons pas ces données avec des tiers.
ja: あなたの体重データは、進捗の表示、統計の計算、体重の旅に関する洞察の提供にのみ使用されます。このデータを第三者と共有することはありません。
ko: 귀하의 체중 데이터는 진행 상황 표시, 통계 계산, 체중 여정에 대한 통찰력 제공에만 사용됩니다. 이 데이터를 제3자와 공유하지 않습니다.
zh_hans: 您的体重数据专门用于显示您的进度、计算统计数据并提供关于您体重旅程的见解。我们不与第三方共享此数据。
zh_hant: 您的體重數據僅用於在應用程序內顯示您的進度。數據不會與第三方共享或用於任何其他目的。

source: Data Storage
de_de: Datenspeicherung
es_es: Almacenamiento de Datos
fr_fr: Stockage des données
ja: データ保存
ko: 데이터 저장
zh_hans: 数据存储
zh_hant: 數據存儲

# data_storage_desc
source: All your data is stored locally on your device using Core Data. We do not store your information on external servers or in the cloud unless you choose to use iCloud sync.
de_de: Alle Ihre Daten werden lokal auf Ihrem Gerät mit Core Data gespeichert. Wir speichern Ihre Informationen nicht auf externen Servern oder in der Cloud, es sei denn, Sie wählen die iCloud-Synchronisation.
es_es: Todos tus datos se almacenan localmente en tu dispositivo usando Core Data. No almacenamos tu información en servidores externos o en la nube a menos que elijas usar la sincronización de iCloud.
fr_fr: Toutes vos données sont stockées localement sur votre appareil en utilisant Core Data. Nous ne stockons pas vos informations sur des serveurs externes ou dans le cloud à moins que vous choisissiez d'utiliser la synchronisation iCloud.
ja: すべてのデータは、Core Dataを使用してデバイスにローカルに保存されます。iCloud同期を選択しない限り、外部サーバーやクラウドに情報を保存することはありません。
ko: 모든 데이터는 Core Data를 사용하여 기기에 로컬로 저장됩니다. iCloud 동기화를 선택하지 않는 한 외부 서버나 클라우드에 정보를 저장하지 않습니다.
zh_hans: 您的所有数据都使用Core Data本地存储在您的设备上。除非您选择使用iCloud同步，否则我们不会将您的信息存储在外部服务器或云端。
zh_hant: 所有數據都安全地存儲在您的設備上。我們不維護您數據的外部副本或備份。

source: Data Export
de_de: Datenexport
es_es: Exportación de Datos
fr_fr: Exportation des données
ja: データエクスポート
ko: 데이터 내보내기
zh_hans: 数据导出
zh_hant: 數據導出

# data_export_desc
source: You can export your data at any time through the app's export feature. This gives you full control over your information.
de_de: Sie können Ihre Daten jederzeit über die Export-Funktion der App exportieren. Dies gibt Ihnen die volle Kontrolle über Ihre Informationen.
es_es: Puedes exportar tus datos en cualquier momento a través de la función de exportación de la aplicación. Esto te da control total sobre tu información.
fr_fr: Vous pouvez exporter vos données à tout moment via la fonction d'exportation de l'application. Cela vous donne un contrôle total sur vos informations.
ja: アプリのエクスポート機能を通じて、いつでもデータをエクスポートできます。これにより、情報を完全にコントロールできます。
ko: 앱의 내보내기 기능을 통해 언제든지 데이터를 내보낼 수 있습니다. 이를 통해 정보를 완전히 제어할 수 있습니다.
zh_hans: 您可以随时通过应用程序的导出功能导出您的数据。这让您完全控制您的信息。
zh_hant: 您可以隨時通過應用程序的導出功能訪問您的數據。導出的數據僅包含您輸入的體重記錄。

source: Data Deletion
de_de: Datenlöschung
es_es: Eliminación de Datos
fr_fr: Suppression des données
ja: データ削除
ko: 데이터 삭제
zh_hans: 数据删除
zh_hant: 數據刪除

# data_deletion_desc
source: You can delete all your data at any time through the app settings. This action is irreversible and will permanently remove all your weight records.
de_de: Sie können alle Ihre Daten jederzeit über die App-Einstellungen löschen. Diese Aktion ist unumkehrbar und entfernt dauerhaft alle Ihre Gewichtsaufzeichnungen.
es_es: Puedes eliminar todos tus datos en cualquier momento a través de la configuración de la aplicación. Esta acción es irreversible y eliminará permanentemente todos tus registros de peso.
fr_fr: Vous pouvez supprimer toutes vos données à tout moment via les paramètres de l'application. Cette action est irréversible et supprimera définitivement tous vos enregistrements de poids.
ja: アプリ設定を通じて、いつでもすべてのデータを削除できます。この操作は元に戻すことができず、すべての体重記録が永続的に削除されます。
ko: 앱 설정을 통해 언제든지 모든 데이터를 삭제할 수 있습니다. 이 작업은 되돌릴 수 없으며 모든 체중 기록이 영구적으로 삭제됩니다.
zh_hans: 您可以随时通过应用程序设置删除所有数据。此操作不可逆转，将永久删除您的所有体重记录。
zh_hant: 您可以隨時通過應用程序設置刪除所有數據。刪除後，數據無法恢復。

source: Loading...
de_de: Lädt...
es_es: Cargando...
fr_fr: Chargement...
ja: 読み込み中...
ko: 로딩 중...
zh_hans: 加载中...
zh_hant: 載入中...

# weight_needed
source: You need
de_de: Sie benötigen
es_es: Necesitas
fr_fr: Vous avez besoin de
ja: 必要な体重
ko: 필요한 체중
zh_hans: 您需要
zh_hant: 需要體重

source: Select target date
de_de: Datum auswählen
es_es: Selecciona la fecha
fr_fr: Sélectionner la date
ja: 日付を選択
ko: 목표 날짜 선택
zh_hans: 选择日期
zh_hant: 選擇目標日期

# duration_days_weeks
source: Duration: %d days (%d weeks)
de_de: Dauer: %d Tage (%d Wochen)
es_es: Duración: %d días (%d semanas)
fr_fr: Durée : %d jours (%d semaines)
ja: 期間：%d日（%d週間）
ko: 기간: %d일 (%d주)
zh_hans: 持续时间：%d天（%d周）
zh_hant: 持續時間：%d天（%d週）

# target_weight_label
source: Target weight
de_de: Zielgewicht
es_es: Peso objetivo
fr_fr: Poids cible
ja: 目標体重
ko: 목표 체중
zh_hans: 目标体重
zh_hant: 目標體重

source: Deadline
de_de: Frist
es_es: Fecha límite
fr_fr: Échéance
ja: 期限
ko: 마감일
zh_hans: 截止日期
zh_hant: 截止日期

source: Required change
de_de: Erforderliche Änderung
es_es: Cambio necesario
fr_fr: Changement requis
ja: 必要な変化
ko: 필요한 변화
zh_hans: 所需变化
zh_hant: 所需變化

source: Gain
de_de: Zunehmen
es_es: Ganar
fr_fr: Prendre
ja: 増量
ko: 증량
zh_hans: 增重
zh_hant: 增重

source: Lose
de_de: Abnehmen
es_es: Perder
fr_fr: Perdre
ja: 減量
ko: 감량
zh_hans: 减重
zh_hant: 減重

source: You need to
de_de: Sie müssen
es_es: Necesitas
fr_fr: Vous devez
ja: 必要です
ko: 필요합니다
zh_hant: 您需要

source: Weekly change
de_de: Wöchentliche Änderung
es_es: Cambio semanal
fr_fr: Changement hebdomadaire
ja: 週間変化
ko: 주간 변화
zh_hans: 每周变化
zh_hant: 每週變化

source: Creating...
de_de: Erstelle...
es_es: Creando...
fr_fr: Création...
ja: 作成中...
ko: 생성 중...
zh_hans: 创建中...
zh_hant: 創建中...

source: Edit Goal
de_de: Ziel bearbeiten
es_es: Editar Objetivo
fr_fr: Modifier l'objectif
ja: 目標を編集
ko: 목표 편집
zh_hans: 编辑目标
zh_hant: 編輯目標

source: Goal in progress
de_de: Ziel in Bearbeitung
es_es: Objetivo en progreso
fr_fr: Objectif en cours
ja: 進行中の目標
ko: 진행 중인 목표
zh_hans: 进行中的目标
zh_hant: 進行中的目標

# adjust_goal_subtitle
source: Adjust your goal based on your current progress
de_de: Passen Sie Ihr Ziel basierend auf Ihrem aktuellen Fortschritt an
es_es: Ajusta tu objetivo según tu progreso actual
fr_fr: Ajustez votre objectif en fonction de vos progrès actuels
ja: 現在の進捗に基づいて目標を調整してください
ko: 목표 조정 부제목
zh_hans: 根据您当前的进度调整您的目标
zh_hant: 根據您當前的進度調整目標

source: Current progress
de_de: Aktueller Fortschritt
es_es: Progreso actual
fr_fr: Progrès actuel
ja: 現在の進捗
ko: 현재 진행상황
zh_hans: 当前进度
zh_hant: 當前進度

# percent_completed
source: % completed
de_de: % abgeschlossen
es_es: % completado
fr_fr: % terminé
ja: % 完了
ko: % 완료
zh_hans: % 已完成
zh_hant: % 已完成

source: Since
de_de: Seit
es_es: Desde
fr_fr: Depuis
ja: 開始日
ko: 시작일
zh_hans: 自
zh_hant: 自

source: Initial weight
de_de: Anfangsgewicht
es_es: Peso inicial
fr_fr: Poids initial
ja: 初期体重
ko: 초기 체중
zh_hans: 初始体重
zh_hant: 初始體重

# current_weight_label
source: Current weight
de_de: Aktuelles Gewicht
es_es: Peso actual
fr_fr: Poids actuel
ja: 現在の体重
ko: 현재 체중
zh_hans: 当前体重
zh_hant: 當前體重

source: Goal
de_de: Ziel
es_es: Objetivo
fr_fr: Objectif
ja: 目標
ko: 목표:
zh_hans: 目标：
zh_hant: 目標：

source: New target weight
de_de: Neues Zielgewicht
es_es: Nuevo peso objetivo
fr_fr: Nouveau poids cible
ja: 新しい目標体重
ko: 새 목표 체중
zh_hans: 新目标体重
zh_hant: 新目標體重

source: Delete Goal
de_de: Ziel löschen
es_es: Eliminar Objetivo
fr_fr: Supprimer l'objectif
ja: 目標を削除
ko: 목표 삭제
zh_hans: 删除目标
zh_hant: 刪除目標

# delete_goal_confirmation
source: Are you sure you want to delete this goal? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie dieses Ziel löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es_es: ¿Estás seguro de que quieres eliminar este objetivo? Esta acción no se puede deshacer.
fr_fr: Êtes-vous sûr de vouloir supprimer cet objectif ? Cette action ne peut pas être annulée.
ja: この目標を削除してもよろしいですか？この操作は元に戻すことができません。
ko: 이 목표를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh_hans: 您确定要删除此目标吗？此操作无法撤销。
zh_hant: 您確定要刪除此目標嗎？此操作無法撤銷。

# goal_delete_confirmation
source: Are you sure you want to delete this goal? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie dieses Ziel löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es_es: ¿Estás seguro de que quieres eliminar este objetivo? Esta acción no se puede deshacer.
fr_fr: Êtes-vous sûr de vouloir supprimer cet objectif ? Cette action ne peut pas être annulée.
ja: この目標を削除してもよろしいですか？この操作は元に戻すことができません。
ko: 이 목표를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh_hant: 您確定要刪除此目標嗎？此操作無法撤銷。

source: New target date
de_de: Neues Zieldatum
es_es: Nueva fecha objetivo
fr_fr: Nouvelle date cible
ja: 新しい目標日
ko: 새 목표 날짜
zh_hans: 新目标日期
zh_hant: 新目標日期

# extend_shorten_goal
source: This will extend/shorten your goal by %d days
de_de: Dies wird Ihr Ziel um %d Tage verlängern/verkürzen
es_es: Esto va a extender/acortar tu objetivo en %d días
fr_fr: Cela prolongera/raccourcira votre objectif de %d jours
ja: これにより目標が%d日延長/短縮されます
ko: 목표 연장/단축
zh_hans: 这将延长/缩短您的目标%d天
zh_hant: 這將延長/縮短您的目標%d天

source: Goal statistics
de_de: Zielstatistiken
es_es: Estadísticas del objetivo
fr_fr: Statistiques de l'objectif
ja: 目標統計
ko: 목표 통계
zh_hans: 目标统计
zh_hant: 目標統計

source: Days elapsed
de_de: Vergangene Tage
es_es: Días transcurridos
fr_fr: Jours écoulés
ja: 経過日数
ko: 경과 일수
zh_hans: 已过天数
zh_hant: 已過天數

source: Weekly average
de_de: Wöchentlicher Durchschnitt
es_es: Promedio semanal
fr_fr: Moyenne hebdomadaire
ja: 週間平均
ko: 주간 평균
zh_hans: 每周平均
zh_hant: 週平均

source: Saving...
de_de: Speichere...
es_es: Guardando...
fr_fr: Sauvegarde...
ja: 保存中...
ko: 저장 중
zh_hans: 保存中...
zh_hant: 保存中...

source: Save Changes
de_de: Änderungen speichern
es_es: Guardar Cambios
fr_fr: Sauvegarder les modifications
ja: 変更を保存
ko: 변경사항 저장
zh_hans: 保存更改
zh_hant: 保存更改

source: of
de_de: von
es_es: de
fr_fr: de
ja: の
ko: 의
zh_hans: 的
zh_hant: 的

source: week
de_de: Woche
es_es: sem
fr_fr: semaine
ja: 週
ko: 주
zh_hans: 周
zh_hant: 週

# valid_weight_error
source: Enter a valid weight (1-500 kg)
de_de: Geben Sie ein gültiges Gewicht ein (1-500 kg)
es_es: Ingresa un peso válido (1-500 kg)
fr_fr: Entrez un poids valide (1-500 kg)
ja: 有効な体重を入力してください（1-500キロ）
ko: 유효한 체중 오류
zh_hans: 输入有效体重（1-500公斤）
zh_hant: 請輸入有效體重

# goal_duration
source: Duration: %d days
de_de: Dauer: %d Tage
es_es: Duración
fr_fr: Durée : %d jours
ja: 期間：%d日
ko: 기간
zh_hans: 持续时间：%d天
zh_hant: 目標持續時間

# goal_date_change
source: This will %@ your goal by %d days
de_de: Dies wird Ihr Ziel um %d Tage %@
es_es: Esto va a modificar tu objetivo
fr_fr: Cela va %@ votre objectif de %d jours
ja: これにより目標が%d日%@されます
ko: 목표 날짜 변경
zh_hans: 这将%@您的目标%d天
zh_hant: 目標日期變更

# update_goal_error
source: Could not update goal. Please try again.
de_de: Ziel konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es_es: No se pudo actualizar el objetivo. Inténtalo de nuevo.
fr_fr: Impossible de mettre à jour l'objectif. Veuillez réessayer.
ja: 目標を更新できませんでした。もう一度お試しください。
ko: 목표 업데이트 오류
zh_hans: 无法更新目标。请重试。
zh_hant: 更新目標時發生錯誤

# goal_already_deleted
source: Goal has already been deleted.
de_de: Das Ziel wurde bereits gelöscht.
es_es: El objetivo ya ha sido eliminado.
fr_fr: L'objectif a déjà été supprimé.
ja: 目標は既に削除されています。
ko: 목표가 이미 삭제되었습니다.
zh_hans: 目标已被删除。
zh_hant: 目標已被刪除。

# delete_goal_error
source: Could not delete goal. Please try again.
de_de: Ziel konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.
es_es: No se pudo eliminar el objetivo. Inténtalo de nuevo.
fr_fr: Impossible de supprimer l'objectif. Veuillez réessayer.
ja: 目標を削除できませんでした。もう一度お試しください。
ko: 목표 삭제 오류
zh_hans: 无法删除目标。请重试。
zh_hant: 刪除目標時發生錯誤

# define_goal_title
source: Define your goal!
de_de: Definieren Sie Ihr Ziel!
es_es: ¡Define tu objetivo!
fr_fr: Définissez votre objectif !
ja: 目標を設定しましょう！
ko: 목표를 정하세요!
zh_hans: 定义您的目标！
zh_hant: 定義您的目標

# define_goal_subtitle
source: Set a weight and date goal to stay motivated in your progress
de_de: Setzen Sie ein Gewichts- und Datumsziel, um bei Ihrem Fortschritt motiviert zu bleiben
es_es: Establece una meta de peso y fecha para mantenerte motivado en tu progreso
fr_fr: Fixez un objectif de poids et une date pour rester motivé dans vos progrès
ja: 進捗のモチベーションを維持するために体重と日付の目標を設定してください
ko: 진행 상황에서 동기를 유지하기 위해 체중과 날짜 목표를 설정하세요
zh_hans: 设置体重和日期目标以在您的进度中保持动力
zh_hant: 設置一個現實且可達成的體重目標

# create_objective
source: Create Goal
de_de: Ziel erstellen
es_es: Crear Objetivo
fr_fr: Créer un objectif
ja: 目標を作成
ko: 목표 생성
zh_hans: 创建目标
zh_hant: 創建目標

# current_objective
source: Current Goal
de_de: Aktuelles Ziel
es_es: Objetivo Actual
fr_fr: Objectif actuel
ja: 現在の目標
ko: 현재 목표
zh_hans: 当前目标
zh_hant: 當前目標

# goal_target
source: Target:
de_de: Ziel:
es_es: Meta:
fr_fr: Objectif :
ja: 目標：
ko: 목표:
zh_hans: 目标：
zh_hant: 目標

source: remaining
de_de: verbleibend
es_es: restantes
fr_fr: restants
ja: 残り
ko: 남음
zh_hans: 剩余
zh_hant: 剩餘

source: Time elapsed
de_de: Verstrichene Zeit
es_es: Tiempo transcurrido
fr_fr: Temps écoulé
ja: 経過時間
ko: 경과 시간
zh_hans: 已用时间
zh_hant: 已過時間

source: Visual Progress
de_de: Visueller Fortschritt
es_es: Progreso Visual
fr_fr: Progrès visuel
ja: 視覚的進捗
ko: 시각적 진행상황
zh_hans: 视觉进度
zh_hant: 視覺進度

source: No Data Available
de_de: Keine Daten verfügbar
es_es: No hay datos suficientes
fr_fr: Aucune donnée disponible
ja: データがありません
ko: 사용 가능한 데이터가 없습니다
zh_hans: 无可用数据
zh_hant: 無可用數據

# record_more_weights
source: Record more weights to see your progress
de_de: Erfassen Sie mehr Gewichte, um Ihren Fortschritt zu sehen
es_es: Registra más pesos para ver tu progreso
fr_fr: Enregistrez plus de poids pour voir vos progrès
ja: 進捗を確認するためにより多くの体重を記録してください
ko: 더 많은 체중 기록
zh_hans: 记录更多体重以查看您的进度
zh_hant: 記錄更多體重

source: Mark as Completed
de_de: Als abgeschlossen markieren
es_es: Marcar como Completado
fr_fr: Marquer comme terminé
ja: 完了としてマーク
ko: 완료로 표시
zh_hans: 标记为已完成
zh_hant: 標記為已完成

# goal_tips
source: Goal setting tips
de_de: Tipps zum Setzen von Zielen
es_es: Consejos para establecer objetivos
fr_fr: Conseils pour fixer des objectifs
ja: 目標設定のヒント
ko: 목표 팁
zh_hans: 目标设定提示
zh_hant: 目標技巧

source: Be realistic
de_de: Seien Sie realistisch
es_es: Sé realista
fr_fr: Soyez réaliste
ja: 現実的に
ko: 현실적이 되세요
zh_hans: 要现实
zh_hant: 要現實

# be_realistic_desc
source: Set achievable and healthy goals
de_de: Setzen Sie erreichbare und gesunde Ziele
es_es: Establece metas alcanzables y saludables
fr_fr: Fixez des objectifs atteignables et sains
ja: 達成可能で健康的な目標を設定してください
ko: 달성 가능하고 건강한 목표를 설정하세요
zh_hans: 设置可实现和健康的目标
zh_hant: 設置現實的目標以保持動力

source: Adequate time
de_de: Angemessene Zeit
es_es: Tiempo adecuado
fr_fr: Temps adéquat
ja: 適切な時間
ko: 적절한 시간
zh_hans: 充足时间
zh_hant: 充足時間

# adequate_time_desc
source: Give yourself enough time to achieve your goal
de_de: Geben Sie sich genügend Zeit, um Ihr Ziel zu erreichen
es_es: Da tiempo suficiente para lograr tu objetivo
fr_fr: Donnez-vous suffisamment de temps pour atteindre votre objectif
ja: 目標達成のために十分な時間を設けてください
ko: 목표를 달성하기 위해 충분한 시간을 주세요
zh_hans: 给自己足够的时间来实现目标
zh_hant: 給自己足夠的時間達成目標

source: Stay motivated
de_de: Bleiben Sie motiviert
es_es: Mantente motivado
fr_fr: Restez motivé
ja: モチベーションを維持
ko: 동기를 유지하세요
zh_hans: 保持动力
zh_hant: 保持動力

# stay_motivated_desc
source: Celebrate small achievements along the way
de_de: Feiern Sie kleine Erfolge auf dem Weg
es_es: Celebra los pequeños logros en el camino
fr_fr: Célébrez les petites victoires en cours de route
ja: 途中の小さな成功を祝いましょう
ko: 과정에서 작은 성취를 축하하세요
zh_hans: 庆祝过程中的小成就
zh_hant: 保持動力並慶祝小成就

# no_weight_data_chart
source: No weight data available to display in chart
de_de: Keine Gewichtsdaten zum Anzeigen im Diagramm verfügbar
es_es: No hay datos de peso disponibles para mostrar en el gráfico
fr_fr: Aucune donnée de poids disponible pour afficher dans le graphique
ja: チャートに表示する体重データがありません
ko: 차트에 표시할 체중 데이터가 없습니다
zh_hans: 没有体重数据可在图表中显示
zh_hant: 沒有體重數據可在圖表中顯示

source: Detailed Statistics
de_de: Detaillierte Statistiken
es_es: Estadísticas Detalladas
fr_fr: Statistiques détaillées
ja: 詳細統計
ko: 상세 통계
zh_hans: 详细统计
zh_hant: 詳細統計

source: Max Weight
de_de: Höchstgewicht
es_es: Peso Máximo
fr_fr: Poids maximum
ja: 最大体重
ko: 최대 체중
zh_hans: 最大体重
zh_hant: 最大體重

source: Min Weight
de_de: Mindestgewicht
es_es: Peso Mínimo
fr_fr: Poids minimum
ja: 最小体重
ko: 최소 체중
zh_hans: 最小体重
zh_hant: 最小體重

source: Total Entries
de_de: Gesamteinträge
es_es: Total Entradas
fr_fr: Total des entrées
ja: 総エントリー数
ko: 총 기록
zh_hans: 总记录
zh_hant: 總記錄

source: Average
de_de: Durchschnitt
es_es: Promedio
fr_fr: Moyenne
ja: 平均
ko: 평균
zh_hans: 平均
zh_hant: 平均

source: Change
de_de: Änderung
es_es: Cambio
fr_fr: Changement
ja: 変化
ko: 변화
zh_hans: 变化
zh_hant: 變化

source: Recent Entries
de_de: Neueste Einträge
es_es: Entradas recientes
fr_fr: Entrées récentes
ja: 最近のエントリ
ko: 최근 기록
zh_hans: 最近记录
zh_hant: 最近記錄
